
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Car · Jamie House</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jamie">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-treeview/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="voice.html" />
    
    
    <link rel="prev" href="money.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Welcome
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="git.html">
            
                <a href="git.html">
            
                    
                    Git
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="http.html">
            
                <a href="http.html">
            
                    
                    Http
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="linux.html">
            
                <a href="linux.html">
            
                    
                    Linux
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="nodejs.html">
            
                <a href="nodejs.html">
            
                    
                    NodeJS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="nginx.html">
            
                <a href="nginx.html">
            
                    
                    Nginx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="javascript.html">
            
                <a href="javascript.html">
            
                    
                    JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="angular.html">
            
                <a href="angular.html">
            
                    
                    Angular
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="java.html">
            
                <a href="java.html">
            
                    
                    Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="docker.html">
            
                <a href="docker.html">
            
                    
                    Docker
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="music.html">
            
                <a href="music.html">
            
                    
                    Music
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="undefined.html">
            
                <a href="undefined.html">
            
                    
                    Undefined
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="guide.html">
            
                <a href="guide.html">
            
                    
                    Guide
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="baking.html">
            
                <a href="baking.html">
            
                    
                    Baking
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="money.html">
            
                <a href="money.html">
            
                    
                    Money
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="6.5" data-path="car.html">
            
                <a href="car.html">
            
                    
                    Car
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.6" data-path="voice.html">
            
                <a href="voice.html">
            
                    
                    Voice
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Car</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="treeview__container"><div class="treeview__container-title"><span class="treeview__main-title">Treeview</span><span class="treeview__copyright">Copyright &#xA9; aleen42 all right reserved, powered by <a href="https://github.com/aleen42" target="_blank">aleen42</a></span></div><ul>
<li><div><a href="#&#x4E34;&#x65F6;&#x505C;&#x8F66;">&#x4E34;&#x65F6;&#x505C;&#x8F66;</a><i></i></div></li>
</ul>
</div>

<ul>
<li>&#x80FD;&#x6E90;&#x7C7B;&#x578B;<ul>
<li>&#x7EAF;&#x7535;&#x52A8;&#xFF1A;&#x80FD;&#x91CF;&#x6765;&#x6E90;&#x53EA;&#x6709;&#x7535;&#xFF0C;&#x8981;&#x63D2;&#x7535;&#xFF0C;&#x5B8C;&#x5168;&#x7531;&#x53EF;&#x5145;&#x7535;&#x7535;&#x6C60;&#x63D0;&#x4F9B;&#x52A8;&#x529B;&#x6E90;&#xFF0C;&#x7535;&#x673A;&#x9A71;&#x52A8;</li>
<li>&#x63D2;&#x7535;&#x6DF7;&#x52A8;&#xFF1A;&#x9A71;&#x52A8;&#x539F;&#x7406;&#x3001;&#x9A71;&#x52A8;&#x5355;&#x5143;&#x4E0E;&#x7535;&#x52A8;&#x8F66;&#x76F8;&#x540C;&#xFF0C;&#x53EF;&#x63D2;&#x7535;&#xFF0C;&#x7535;&#x91CF;&#x8017;&#x5C3D;&#x53EF;&#x542F;&#x52A8;&#x5185;&#x71C3;&#x673A;&#x9A71;&#x52A8;</li>
<li>&#x6CB9;&#x7535;&#x6DF7;&#x52A8;&#xFF1A;&#x5728;&#x4F20;&#x7EDF;&#x71C3;&#x6CB9;&#x8F66;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x589E;&#x52A0;&#x7535;&#x52A8;&#x673A;&#x3001;&#x7535;&#x6C60;&#x3001;&#x7535;&#x63A7;&#x800C;&#x6210;&#xFF0C;&#x7531;&#x7535;&#x52A8;&#x673A;&#x4E0E;&#x53D1;&#x52A8;&#x673A;&#x5171;&#x540C;&#x9A71;&#x52A8;&#x8F66;&#x8F6E;&#xFF0C;&#x5982;&#x4E30;&#x7530;&#x51EF;&#x7F8E;&#x745E;&#x3001;&#x672C;&#x7530;&#x96C5;&#x9601;&#x6DF7;&#x52A8;&#x3001;&#x522B;&#x514B;&#x541B;&#x8D8A;</li>
<li>&#x589E;&#x7A0B;&#x5F0F;&#xFF1A;&#x6709;&#x53D1;&#x52A8;&#x673A;&#x3001;&#x53D1;&#x7535;&#x673A;&#x3001;&#x7535;&#x6C60;&#xFF0C;&#x53D1;&#x52A8;&#x673A;&#x4E0D;&#x76F4;&#x63A5;&#x63D0;&#x4F9B;&#x52A8;&#x529B;&#xFF0C;&#x7535;&#x91CF;&#x8DB3;&#x65F6;&#x91C7;&#x7528;&#x7EAF;&#x7535;&#x52A8;&#x6A21;&#x5F0F;&#x884C;&#x9A76;&#xFF0C;&#x7535;&#x91CF;&#x4E0D;&#x8DB3;&#x65F6;&#x53D1;&#x52A8;&#x673A;&#x5E26;&#x52A8;&#x53D1;&#x7535;&#x673A;&#x4E3A;&#x52A8;&#x529B;&#x7535;&#x6C60;&#x5145;&#x7535;&#xFF08;&#x6CB9;&#x8F6C;&#x7535;&#xFF09;</li>
</ul>
</li>
</ul>
<ul>
<li>&#x6700;&#x5927;&#x529F;&#x7387;(KW)&#xFF1A;&#x4E00;&#x53F0;&#x53D1;&#x52A8;&#x673A;&#x6240;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x6700;&#x5927;&#x52A8;&#x529B;&#x8F93;&#x51FA;</li>
<li>&#x6700;&#x5927;&#x626D;&#x77E9;(N.m)&#xFF1A;&#x53D1;&#x52A8;&#x673A;&#x8FD0;&#x8F6C;&#x65F6;&#x4ECE;&#x66F2;&#x8F74;&#x7AEF;&#x8F93;&#x51FA;&#x7684;&#x5E73;&#x5747;&#x529B;&#x77E9;</li>
<li>&#x53D1;&#x52A8;&#x673A;&#xFF1A;&#x5C06;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x80FD;&#x8F6C;&#x5316;&#x6210;&#x52A8;&#x80FD;&#x7684;&#x673A;&#x6784;</li>
</ul>
<ul>
<li>&#x53D8;&#x901F;&#x7BB1;<ul>
<li>&#x624B;&#x52A8;(MT)&#xFF1A;&#x4E3B;&#x8981;&#x7531;&#x9F7F;&#x8F6E;&#x548C;&#x8F74;&#x7EC4;&#x6210;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x9F7F;&#x8F6E;&#x7EC4;&#x5408;&#x4EA7;&#x751F;&#x53D8;&#x901F;&#x53D8;&#x77E9;</li>
<li>&#x81EA;&#x52A8;&#xFF1A;&#x6839;&#x636E;&#x6CB9;&#x95E8;&#x8E0F;&#x677F;&#x7A0B;&#x5EA6;&#x548C;&#x8F66;&#x901F;&#x53D8;&#x5316;&#xFF0C;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x53D8;&#x901F;<ul>
<li>&#x6DB2;&#x529B;&#x81EA;&#x52A8;&#x53D8;&#x901F;&#x7BB1;(AT)&#xFF1A;&#x6DB2;&#x529B;&#x4F20;&#x9012;&#x548C;&#x9F7F;&#x8F6E;&#x7EC4;&#x5408;&#xFF0C;&#x6362;&#x6321;&#x5E73;&#x987A;&#x6280;&#x672F;&#x6210;&#x719F;</li>
<li>&#x7535;&#x63A7;&#x673A;&#x68B0;&#x81EA;&#x52A8;&#x53D8;&#x901F;&#x7BB1;(AMT)&#xFF1A;&#x673A;&#x68B0;&#x53D8;&#x901F;&#x5668;&#x57FA;&#x7840;&#x4E0A;&#x52A0;&#x88C5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x5207;&#x6362;&#x6321;&#x4F4D;&#xFF0C;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#x6362;&#x6321;&#x6548;&#x7387;&#x9AD8;</li>
<li>&#x673A;&#x68B0;&#x65E0;&#x7EA7;&#x81EA;&#x52A8;&#x53D8;&#x901F;&#x7BB1;(CVT)&#xFF1A;&#x4F20;&#x52A8;&#x5E26;&#x548C;&#x53EF;&#x53D8;&#x69FD;&#x5BBD;&#x7684;&#x9525;&#x5F62;&#x538B;&#x76D8;&#x8FDB;&#x884C;&#x52A8;&#x529B;&#x4F20;&#x9012;</li>
<li>&#x53CC;&#x79BB;&#x5408;&#x53D8;&#x901F;&#x7BB1;(DCT)&#xFF1A;&#x4E24;&#x5957;&#x79BB;&#x5408;&#x5668;&#x7684;&#x76F8;&#x4E92;&#x4EA4;&#x66FF;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F4E;&#x901F;&#x5E73;&#x987A;&#x6027;&#x5DEE;&#xFF0C;&#x6362;&#x6321;&#x901F;&#x5EA6;&#x76F8;&#x5F53;&#x5FEB;</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li>&#x53D1;&#x52A8;&#x673A;</li>
<li>&#x53D8;&#x901F;&#x7BB1;</li>
</ul>
<ul>
<li><p>&#x5E7F;&#x5DDE;&#x8F66;&#x724C;&#x7ADE;&#x4EF7;</p>
<p>1&#x3001;&#x8F66;&#x724C;&#x6307;&#x6807;&#x5B98;&#x7F51;&#x7533;&#x8BF7;&#x7ADE;&#x4EF7;&#x8D44;&#x683C;&#xFF08;&#x6216;&#x6301;&#x8EAB;&#x4EFD;&#x8BC1;&#x7B49;&#x8BC1;&#x4EF6;&#x5230;&#x7A97;&#x53E3;&#x7533;&#x8BF7;&#xFF09;</p>
<p>2&#x3001;&#x53D7;&#x7406;&#x5355;&#x4F4D;&#x5BA1;&#x6838;&#xFF08;&#x672A;&#x901A;&#x8FC7;&#x9700;&#x91CD;&#x65B0;&#x7533;&#x8BF7;&#xFF09;</p>
<p>3&#x3001;&#x5728;&#x5F53;&#x6708;&#x89C4;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x7F34;&#x7EB3;2000&#x5143;&#x4FDD;&#x8BC1;&#x91D1;</p>
<p>4&#x3001;&#x4FDD;&#x8BC1;&#x91D1;&#x7F34;&#x7EB3;&#x6210;&#x529F;&#x7684;&#x5728;&#x7ADE;&#x4EF7;&#x5F53;&#x65E5;&#x51ED;&#x501F;&#x7533;&#x8BF7;&#x8D44;&#x683C;&#x65F6;&#x7684;&#x7533;&#x8BF7;&#x53F7;&#x53CA;&#x5BC6;&#x7801;&#xFF0C;&#x767B;&#x9646;&#x7ADE;&#x4EF7;&#x5B98;&#x7F51;&#xFF08;&#x4E0E;&#x7B2C;&#x4E00;&#x6B21;&#x7533;&#x8BF7;&#x65F6;&#x7F51;&#x5740;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x8FDB;&#x884C;&#x62A5;&#x4EF7;&#x3002;&#x672A;&#x83B7;&#x5F97;&#x8F66;&#x724C;&#x6307;&#x6807;&#x7684;&#x7ADE;&#x62CD;&#x4EBA;&#xFF0C;&#x4FDD;&#x8BC1;&#x91D1;&#x9000;&#x8FD8;&#xFF01;</p>
<p>5&#x3001;&#x62A5;&#x4EF7;&#x6700;&#x9AD8;&#x5E76;&#x83B7;&#x5F97;&#x8F66;&#x724C;&#x6307;&#x6807;&#x540E;&#xFF0C;&#x5728;&#x89C4;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x7F34;&#x7EB3;&#x8F66;&#x724C;&#x8D2D;&#x4E70;&#x91D1;&#xFF08;&#x62CD;&#x5356;&#x65F6;&#x6210;&#x4EA4;&#x4EF7;&#x591A;&#x5C11;&#x5C31;&#x7F34;&#x591A;&#x5C11;&#xFF09;&#xFF0C;&#x7F34;&#x7EB3;&#x8F66;&#x724C;&#x62CD;&#x5356;&#x6B3E;&#x540E;&#xFF0C;&#x4FDD;&#x8BC1;&#x91D1;&#x9000;&#x8FD8;&#xFF01;&#x672A;&#x7F34;&#x6B3E;&#x8005;&#x4FDD;&#x8BC1;&#x91D1;&#x6CA1;&#x6536;&#xFF01;</p>
<p>6&#x3001;&#x534A;&#x5E74;&#x5185;&#x8D2D;&#x4E70;&#x6C7D;&#x8F66;&#xFF0C;&#x5E76;&#x5230;&#x8F66;&#x7BA1;&#x6240;&#x4F7F;&#x7528;&#x6307;&#x6807;&#x4E0A;&#x724C;&#xFF08;&#x5230;&#x8F66;&#x7BA1;&#x6240;&#x524D;&#x53EF;&#x7F51;&#x4E0A;&#x81EA;&#x9009;&#x8F66;&#x724C;&#x53F7;&#x7801;&#xFF09;&#xFF01;</p>
</li>
</ul>
<p>&#x6C7D;&#x6CB9;&#x6807;&#x53F7;&#xFF1A;&#x5B9E;&#x9645;&#x6C7D;&#x6CB9;&#x6297;&#x7206;&#x6027;&#x4E0E;&#x6807;&#x51C6;&#x6C7D;&#x6CB9;&#x7684;&#x6297;&#x7206;&#x6027;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x6807;&#x53F7;&#x8D8A;&#x9AD8;&#x8F9B;&#x70F7;&#x503C;&#x8D8A;&#x9AD8;&#xFF0C;&#x6839;&#x636E;&#x53D1;&#x52A8;&#x673A;&#x538B;&#x7F29;&#x6BD4;&#x9009;&#x62E9;&#x6C7D;&#x6CB9;&#x6807;&#x53F7;</p>
<p>&#x6297;&#x7206;&#x6027;&#xFF1A;&#x6C7D;&#x6CB9;&#x62B5;&#x6297;&#x7206;&#x71C3;&#x7684;&#x80FD;&#x529B;</p>
<p>&#x6C14;&#x7F38;&#x8FD0;&#x4F5C;&#xFF1A;&#x5438;&#x6C14;--&#x538B;&#x7F29;--&#x71C3;&#x70E7;--&#x6392;&#x6C14;--&#x5438;&#x6C14;</p>
<p>&#x7206;&#x9707;&#xFF1A;&#x538B;&#x7F29;&#x8FD8;&#x672A;&#x5B8C;&#x6210;&#x5C31;&#x63D0;&#x524D;&#x8FDB;&#x884C;&#x71C3;&#x70E7;&#xFF0C;&#x9020;&#x6210;&#x52A8;&#x529B;&#x6D41;&#x5931;&#xFF0C;&#x4EE5;&#x53CA;&#x6572;&#x7F38;&#x4EA7;&#x751F;&#x632F;&#x52A8;</p>
<p>&#x538B;&#x7F29;&#x6BD4;&#xFF1A;&#x6D3B;&#x585E;&#x5728;&#x884C;&#x7A0B;&#x7684;&#x6700;&#x8FDC;&#x70B9;&#x548C;&#x6700;&#x8FD1;&#x70B9;&#x65F6;&#x7684;&#x6C14;&#x7F38;&#x4F53;&#x79EF;&#x4E4B;&#x6BD4;</p>
<p>&#x9AD8;&#x901F;&#x6536;&#x8D39;&#xFF1A;&#x8FDB;&#x5165;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#xFF0C;&#x5728;&#x6536;&#x8D39;&#x7AD9;&#x9886;&#x53D6;&#x4E00;&#x5F20;&#x901A;&#x884C;&#x5238;&#xFF0C;&#x8FD9;&#x5F20;&#x5238;&#x8BB0;&#x5F55;&#x4E86;&#x8F66;&#x8F86;&#x7684;&#x5165;&#x7AD9;&#x540D;&#x79F0;&#x3001;&#x65F6;&#x95F4;&#x8F66;&#x724C;&#x548C;&#x8F66;&#x578B;&#x3002;&#x51FA;&#x6536;&#x8D39;&#x7AD9;&#x65F6;&#x518D;&#x628A;&#x901A;&#x884C;&#x5238;&#x4EA4;&#x7ED9;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x6839;&#x636E;&#x4F60;&#x7684;&#x884C;&#x9A76;&#x8DDD;&#x79BB;&#xFF0C;&#x8F66;&#x8F86;&#x7C7B;&#x522B;&#x5E76;&#x6536;&#x53D6;&#x9AD8;&#x901F;&#x516C;&#x8DEF;&#x901A;&#x884C;&#x8D39;</p>
<p>&#x6307;&#x793A;&#x724C;&#xFF0C;&#x9A6C;&#x8DEF;&#x7EBF;</p>
<p>&#x4EA4;&#x901A;&#x89C4;&#x5219;</p>
<ul>
<li>&#x673A;&#x6CB9;&#xFF1A;&#x53D1;&#x52A8;&#x673A;&#x6DA6;&#x6ED1;&#x6CB9;&#xFF0C;&#x5BF9;&#x53D1;&#x52A8;&#x673A;&#x8D77;&#x5230;&#x6DA6;&#x6ED1;&#x51CF;&#x78E8;&#x3001;&#x8F85;&#x52A9;&#x51B7;&#x5374;&#x964D;&#x6E29;&#x3001;&#x5BC6;&#x5C01;&#x9632;&#x6F0F;&#x3001;&#x9632;&#x9508;&#x9632;&#x8680;&#x3001;&#x51CF;&#x9707;&#x7F13;&#x51B2;&#x7B49;&#x4F5C;<ul>
<li>&#x57FA;&#x7840;&#x6CB9;</li>
<li>&#x6DFB;&#x52A0;&#x5242;</li>
</ul>
</li>
</ul>
<p>&#x5E74;&#x5BA1;</p>
<p><strong>&#x706F;&#x5149;</strong></p>
<ul>
<li>&#x8FDC;&#x5149;&#x706F;<ul>
<li>&#x591C;&#x95F4;&#x5728;&#x6CA1;&#x6709;&#x8DEF;&#x706F;&#x7167;&#x660E;&#x4E0D;&#x826F;&#x6761;&#x4EF6;&#x4E0B;&#x884C;&#x9A76;</li>
</ul>
</li>
<li>&#x8FD1;&#x5149;&#x706F;<ul>
<li>&#x591C;&#x95F4;&#x4E0E;&#x673A;&#x52A8;&#x8F66;&#x4F1A;&#x8F66;</li>
<li>&#x591C;&#x95F4;&#x540C;&#x65B9;&#x5411;&#x8FD1;&#x8DDD;&#x79BB;&#x8DDF;&#x8F66;&#x884C;&#x9A76;</li>
<li>&#x591C;&#x95F4;&#x8DEF;&#x53E3;&#x53F3;&#x8F6C;&#x5F2F;</li>
<li>&#x591C;&#x95F4;&#x5728;&#x7167;&#x660E;&#x826F;&#x597D;&#x9053;&#x8DEF;&#x4E0A;&#x884C;&#x9A76;</li>
</ul>
</li>
<li>&#x5E94;&#x6025;&#x706F;<ul>
<li>&#x8DEF;&#x8FB9;&#x4E34;&#x65F6;&#x505C;&#x8F66;</li>
<li>&#x591C;&#x95F4;&#x5728;&#x9053;&#x8DEF;&#x4E0A;&#x53D1;&#x751F;&#x4EA4;&#x901A;&#x4E8B;&#x6545;&#xFF0C;&#x59A8;&#x788D;&#x4EA4;&#x901A;&#x53C8;&#x96BE;&#x4EE5;&#x79FB;&#x52A8;</li>
</ul>
</li>
<li>&#x95EA;&#x706F;<ul>
<li>&#x591C;&#x95F4;&#x901A;&#x8FC7;&#x5761;&#x8DEF;&#x3001;&#x62F1;&#x6865;</li>
<li>&#x591C;&#x95F4;&#x8D85;&#x8D8A;&#x524D;&#x65B9;&#x8F66;&#x8F86;</li>
<li>&#x591C;&#x95F4;&#x901A;&#x8FC7;&#x6025;&#x5F2F;&#x3001;&#x5761;&#x8DEF;</li>
<li>&#x591C;&#x95F4;&#x5728;&#x6CA1;&#x6709;&#x4EA4;&#x901A;&#x4FE1;&#x53F7;&#x706F;&#x63A7;&#x5236;&#x7684;&#x8DEF;&#x53E3;</li>
</ul>
</li>
</ul>
<p>&#x524D;&#x96FE;&#x706F;&#xFF1A;&#x9AD8;&#x4EAE;&#x5EA6;&#x7684;&#x6563;&#x5C04;&#x5149;&#x6E90;&#xFF0C;&#x4E86;&#x7A7F;&#x900F;&#x6D53;&#x96FE;&#xFF0C;&#x8D77;&#x5230;&#x63D0;&#x9192;&#x76F8;&#x5BF9;&#x65B9;&#x5411;&#x9A7E;&#x9A76;&#x5458;&#x7684;&#x4F5C;&#x7528;</p>
<p>&#x540E;&#x96FE;&#x706F;&#xFF1A;&#x9AD8;&#x4EAE;&#x5EA6;&#x7EA2;&#x8272;&#x5149;&#x6E90;&#xFF0C;&#x7EA2;&#x8272;&#x662F;&#x6CE2;&#x957F;&#x6700;&#x957F;&#x7684;&#x53EF;&#x89C1;&#x5149;&#xFF0C;&#x6CE2;&#x957F;&#x957F;&#xFF0C;&#x7A7F;&#x900F;&#x529B;&#x5C31;&#x597D;&#xFF0C;&#x5728;&#x96FE;&#x3001;&#x973E;&#x3001;&#x96EA;&#x3001;&#x96E8;&#x6216;&#x5C18;&#x57C3;&#x5F25;&#x6F2B;&#x7B49;&#x80FD;&#x89C1;&#x5EA6;&#x8F83;&#x4F4E;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8BA9;&#x8F66;&#x8F86;&#x540E;&#x9762;&#x7684;&#x6C7D;&#x8F66;&#x9A7E;&#x9A76;&#x5458;&#x6613;&#x4E8E;&#x53D1;&#x73B0;&#x4F60;&#x7684;&#x6C7D;&#x8F66;</p>
<p>&#x5236;&#x52A8;&#x706F;&#xFF1A;&#x548C;&#x5236;&#x52A8;&#x8E0F;&#x677F;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5F53;&#x9A7E;&#x8F66;&#x4EBA;&#x8E29;&#x4E0B;&#x5236;&#x52A8;&#x8E0F;&#x677F;&#x65F6;&#xFF0C;&#x5236;&#x52A8;&#x706F;&#x5373;&#x4EAE;&#x8D77;&#xFF0C;&#x5E76;&#x53D1;&#x51FA;&#x7EA2;&#x8272;&#x5149;&#xFF0C;&#x63D0;&#x9192;&#x540E;&#x9762;&#x7684;&#x8F66;&#x8F86;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x8981;&#x8FFD;&#x5C3E;&#x3002;&#x5F53;&#x9A7E;&#x8F66;&#x4EBA;&#x677E;&#x5F00;&#x5236;&#x52A8;&#x8E0F;&#x677F;&#x65F6;&#x5236;&#x52A8;&#x706F;&#x5373;&#x7184;&#x706D;</p>
<p>&#x53CC;&#x95EA;&#xFF1A;&#x8F66;&#x8F86;&#x53D1;&#x751F;&#x610F;&#x5916;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x5F15;&#x8D77;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x8B66;&#x60D5;&#xFF0C;&#x4E34;&#x65F6;&#x505C;&#x8F66;</p>
<p>&#x4FA7;&#x65B9;&#x505C;&#x8F66;&#xFF08;&#x53F3;&#xFF09;&#xFF1A;R&#x6863;&#xFF0C;&#x53F3;&#x6EE1;&#xFF0C;&#x53F3;&#x955C;&#x5C3E;&#x5BF9;&#x89D2;&#xFF0C;&#x6B63;&#xFF0C;&#x53F3;&#x80CE;&#x5165;&#x7EBF;&#xFF0C;&#x5DE6;&#x6EE1;</p>
<h2 id="&#x4E34;&#x65F6;&#x505C;&#x8F66;">&#x4E34;&#x65F6;&#x505C;&#x8F66;</h2>
<p>&#x4E2D;&#x534E;&#x4EBA;&#x6C11;&#x5171;&#x548C;&#x56FD;&#x9053;&#x8DEF;&#x4EA4;&#x901A;&#x5B89;&#x5168;&#x6CD5;&#x5B9E;&#x65BD;&#x6761;&#x4F8B;</p>
<p>&#x7B2C;&#x516D;&#x5341;&#x4E09;&#x6761; &#x673A;&#x52A8;&#x8F66;&#x5728;&#x9053;&#x8DEF;&#x4E0A;&#x4E34;&#x65F6;&#x505C;&#x8F66;&#xFF0C;&#x5E94;&#x5F53;&#x9075;&#x5B88;&#x4E0B;&#x5217;&#x89C4;&#x5B9A;&#xFF1A;
  (&#x4E00;)&#x5728;&#x8BBE;&#x6709;&#x7981;&#x505C;&#x6807;&#x5FD7;&#x3001;&#x6807;&#x7EBF;&#x7684;&#x8DEF;&#x6BB5;&#xFF0C;&#x5728;&#x673A;&#x52A8;&#x8F66;&#x9053;&#x4E0E;&#x975E;&#x673A;&#x52A8;&#x8F66;&#x9053;&#x3001;&#x4EBA;&#x884C;&#x9053;&#x4E4B;&#x95F4;&#x8BBE;&#x6709;&#x9694;&#x79BB;&#x8BBE;&#x65BD;&#x7684;&#x8DEF;&#x6BB5;&#x4EE5;&#x53CA;&#x4EBA;&#x884C;&#x6A2A;&#x9053;&#x3001;&#x65BD;&#x5DE5;&#x5730;&#x6BB5;&#xFF0C;&#x4E0D;&#x5F97;&#x505C;&#x8F66;&#xFF1B;
  (&#x4E8C;)&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x3001;&#x94C1;&#x8DEF;&#x9053;&#x53E3;&#x3001;&#x6025;&#x5F2F;&#x8DEF;&#x3001;&#x5BBD;&#x5EA6;&#x4E0D;&#x8DB3;4&#x7C73;&#x7684;&#x7A84;&#x8DEF;&#x3001;&#x6865;&#x6881;&#x3001;&#x9661;&#x5761;&#x3001;&#x96A7;&#x9053;&#x4EE5;&#x53CA;&#x8DDD;&#x79BB;&#x4E0A;&#x8FF0;&#x5730;&#x70B9;50&#x7C73;&#x4EE5;&#x5185;&#x7684;&#x8DEF;&#x6BB5;&#xFF0C;&#x4E0D;&#x5F97;&#x505C;&#x8F66;&#xFF1B;
  (&#x4E09;)&#x516C;&#x5171;&#x6C7D;&#x8F66;&#x7AD9;&#x3001;&#x6025;&#x6551;&#x7AD9;&#x3001;&#x52A0;&#x6CB9;&#x7AD9;&#x3001;&#x6D88;&#x9632;&#x6813;&#x6216;&#x8005;&#x6D88;&#x9632;&#x961F;(&#x7AD9;)&#x95E8;&#x524D;&#x4EE5;&#x53CA;&#x8DDD;&#x79BB;&#x4E0A;&#x8FF0;&#x5730;&#x70B9;30&#x7C73;&#x4EE5;&#x5185;&#x7684;&#x8DEF;&#x6BB5;&#xFF0C;&#x9664;&#x4F7F;&#x7528;&#x4E0A;&#x8FF0;&#x8BBE;&#x65BD;&#x7684;&#x4EE5;&#x5916;&#xFF0C;&#x4E0D;&#x5F97;&#x505C;&#x8F66;&#xFF1B;
  (&#x56DB;)&#x8F66;&#x8F86;&#x505C;&#x7A33;&#x524D;&#x4E0D;&#x5F97;&#x5F00;&#x8F66;&#x95E8;&#x548C;&#x4E0A;&#x4E0B;&#x4EBA;&#x5458;&#xFF0C;&#x5F00;&#x5173;&#x8F66;&#x95E8;&#x4E0D;&#x5F97;&#x59A8;&#x788D;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x548C;&#x884C;&#x4EBA;&#x901A;&#x884C;&#xFF1B;
  (&#x4E94;)&#x8DEF;&#x8FB9;&#x505C;&#x8F66;&#x5E94;&#x5F53;&#x7D27;&#x9760;&#x9053;&#x8DEF;&#x53F3;&#x4FA7;&#xFF0C;&#x673A;&#x52A8;&#x8F66;&#x9A7E;&#x9A76;&#x4EBA;&#x4E0D;&#x5F97;&#x79BB;&#x8F66;&#xFF0C;&#x4E0A;&#x4E0B;&#x4EBA;&#x5458;&#x6216;&#x8005;&#x88C5;&#x5378;&#x7269;&#x54C1;&#x540E;&#xFF0C;&#x7ACB;&#x5373;&#x9A76;&#x79BB;&#xFF1B;
  (&#x516D;)&#x57CE;&#x5E02;&#x516C;&#x5171;&#x6C7D;&#x8F66;&#x4E0D;&#x5F97;&#x5728;&#x7AD9;&#x70B9;&#x4EE5;&#x5916;&#x7684;&#x8DEF;&#x6BB5;&#x505C;&#x8F66;&#x4E0A;&#x4E0B;&#x4E58;&#x5BA2;&#x3002;</p>
<p>&#x4E34;&#x65F6;&#x505C;&#x8F66;&#xFF1A;&#x8F66;&#x8F86;&#x5728;&#x975E;&#x7981;&#x6B62;&#x505C;&#x8F66;&#x7684;&#x8DEF;&#x9762;&#xFF0C;&#x5728;&#x9A7E;&#x9A76;&#x5458;&#x4E0D;&#x79BB;&#x5F00;&#x8F66;&#x8F86;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9760;&#x9053;&#x8DEF;&#x53F3;&#x8FB9;&#x6309;&#x987A;&#x884C;&#x65B9;&#x5411;&#x4F5C;&#x77ED;&#x6682;&#x505C;&#x7559;</p>
<p>&#x7981;&#x6B62;&#x505C;&#x8F66;&#xFF1A;&#x4E0D;&#x80FD;&#x505C;&#x7559;</p>
<p><img src="https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=1447425197,3333386505&amp;fm=173&amp;app=25&amp;f=JPEG?w=498&amp;h=297&amp;s=E2EBBF52442C6D0D10549059030070F5"></p>
<p>&#x7981;&#x6B62;&#x957F;&#x65F6;&#x95F4;&#x505C;&#x8F66;(&#x4E34;&#x65F6;&#x505C;&#x8F66;)&#xFF1A;&#x5141;&#x8BB8;&#x505C;&#x8F66;&#xFF0C;&#x4F46;&#x53EA;&#x80FD;&#x77ED;&#x6682;&#x505C;&#x7559;</p>
<p><img src="https://ss2.baidu.com/6ONYsjip0QIZ8tyhnq/it/u=2555130032,2413469202&amp;fm=173&amp;app=25&amp;f=JPEG?w=498&amp;h=297&amp;s=F3733FD2446C7D0D105490580300F0F5"></p>
<p>&#x68C0;&#x67E5;&#xFF1A;&#x80CE;&#x538B;&#x3001;&#x673A;&#x6CB9;&#x3001;&#x51B7;&#x5374;&#x6C34;&#x3001;&#x706F;&#x5149;&#x3001;&#x51B7;&#x5374;&#x6DB2;&#x3001;&#x5236;&#x52A8;&#x6DB2;&#x3001;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="money.html" class="navigation navigation-prev " aria-label="Previous page: Money">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="voice.html" class="navigation navigation-next " aria-label="Next page: Voice">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Car","level":"6.5","depth":1,"next":{"title":"Voice","level":"6.6","depth":1,"path":"post/voice.md","ref":"post/voice.md","articles":[]},"previous":{"title":"Money","level":"6.4","depth":1,"path":"post/money.md","ref":"post/money.md","articles":[]},"dir":"ltr"},"config":{"plugins":["page-treeview","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"page-treeview":{"copyright":"Copyright © aleen42","minHeaderCount":"1","minHeaderDeep":"1"},"splitter":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Jamie","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Jamie House","gitbook":"*","description":"V5"},"file":{"path":"post/car.md","mtime":"2019-06-10T09:21:26.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-10T09:26:27.370Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

