
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Data Structure · Jamie House</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jamie">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-treeview/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="http.html" />
    
    
    <link rel="prev" href="git.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Contents
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="git.html">
            
                <a href="git.html">
            
                    
                    Git
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="dataStructure.html">
            
                <a href="dataStructure.html">
            
                    
                    Data Structure
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="http.html">
            
                <a href="http.html">
            
                    
                    Http
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="linux.html">
            
                <a href="linux.html">
            
                    
                    Linux
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="nodejs.html">
            
                <a href="nodejs.html">
            
                    
                    NodeJS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="nginx.html">
            
                <a href="nginx.html">
            
                    
                    Nginx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="javascript.html">
            
                <a href="javascript.html">
            
                    
                    JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="angular.html">
            
                <a href="angular.html">
            
                    
                    Angular
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="java.html">
            
                <a href="java.html">
            
                    
                    Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="docker.html">
            
                <a href="docker.html">
            
                    
                    Docker
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="music.html">
            
                <a href="music.html">
            
                    
                    Music
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="undefined.html">
            
                <a href="undefined.html">
            
                    
                    Undefined
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="guide.html">
            
                <a href="guide.html">
            
                    
                    Guide
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Data Structure</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="treeview__container"><div class="treeview__container-title"><span class="treeview__main-title">Treeview</span><span class="treeview__copyright">Copyright &#xA9; aleen42 all right reserved, powered by <a href="https://github.com/aleen42" target="_blank">aleen42</a></span></div><ul>
<li><div><a href="#sort">sort</a><i></i></div></li>
</ul>
</div>

<h3 id="data-structure">Data structure</h3>
<p><strong>&#x6570;&#x636E;&#x7ED3;&#x6784;</strong></p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x7814;&#x7A76;&#x975E;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x64CD;&#x4F5C;
&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1; = &#x6570;&#x636E;&#x7ED3;&#x6784; + &#x7B97;&#x6CD5;</p>
<p>&#x6570;&#x636E;&#xFF1A;&#x63CF;&#x8FF0;&#x5BA2;&#x89C2;&#x4E8B;&#x7269;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x80FD;&#x88AB;&#x8BA1;&#x7B97;&#x673A;&#x8BC6;&#x522B;&#xFF0C;&#x5E76;&#x8F93;&#x5165;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x7406;&#x7684;&#x7B26;&#x53F7;&#x96C6;&#x5408;
&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF1A;&#x662F;&#x6027;&#x8D28;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x7684;&#x5B50;&#x96C6;
&#x6570;&#x636E;&#x5143;&#x7D20;&#xFF1A;&#x7EC4;&#x6210;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;
&#x6570;&#x636E;&#x9879;&#xFF1A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x7531;&#x82E5;&#x5E72;&#x4E2A;&#x6570;&#x636E;&#x9879;&#x7EC4;&#x6210;&#xFF0C;&#x6570;&#x636E;&#x9879;&#x662F;&#x6570;&#x636E;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;</p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x96C6;&#x5408;</p>
<p>&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF1A;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4E2D;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5173;&#x7CFB;</p>
<ul>
<li>&#x96C6;&#x5408;&#x7ED3;&#x6784;&#xFF1A;&#x96C6;&#x5408;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x9664;&#x4E86;&#x540C;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x5173;&#x7CFB;</li>
<li>&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#xFF1A;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;</li>
<li>&#x6811;&#x5F62;&#x7ED3;&#x6784;&#xFF1A;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5C42;&#x6B21;&#x5173;&#x7CFB;</li>
<li>&#x56FE;&#x5F62;&#x7ED3;&#x6784;&#xFF1A;&#x56FE;&#x5F62;&#x7ED3;&#x6784;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x662F;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;</li>
</ul>
<p>&#x7269;&#x7406;&#x7ED3;&#x6784;&#xFF1A;&#x6570;&#x636E;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x50A8;&#x5B58;&#x5F62;&#x5F0F;</p>
<ul>
<li>&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF1A;&#x628A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x5728;&#x5730;&#x5740;&#x8FDE;&#x7EED;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x91CC;&#xFF0C;&#x5176;&#x6570;&#x636E;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x548C;&#x7269;&#x7406;&#x5173;&#x7CFB;&#x662F;&#x4E00;&#x81F4;&#x7684;</li>
<li>&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF1A;&#x628A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x5728;&#x4EFB;&#x610F;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x91CC;&#xFF0C;&#x8FD9;&#x7EC4;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x53EF;&#x4EE5;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x8FDE;&#x7EED;</li>
</ul>
<p>&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x4E00;&#x7EC4;&#x6027;&#x8D28;&#x76F8;&#x540C;&#x7684;&#x503C;&#x7684;&#x96C6;&#x5408;&#x53CA;&#x5B9A;&#x4E49;&#x5728;&#x6B64;&#x96C6;&#x5408;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x7684;&#x603B;&#x79F0;</p>
<p>&#x7B97;&#x6CD5;&#xFF1A;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x6C42;&#x89E3;&#x6B65;&#x9AA4;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x8868;&#x73B0;&#x4E3A;&#x6307;&#x4EE4;&#x7684;&#x6709;&#x9650;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6761;&#x6307;&#x4EE4;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;
&#x7B97;&#x6CD5;&#x7684;&#x4E94;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x6027;&#xFF1A;&#x8F93;&#x5165;&#x3001;&#x8F93;&#x51FA;&#x3001;&#x6709;&#x7A77;&#x6027;&#x3001;&#x786E;&#x5B9A;&#x6027;&#x3001;&#x53EF;&#x884C;&#x6027;</p>
<p>&#x7B97;&#x6CD5;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#xFF1A;&#x6B63;&#x786E;&#x6027;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x5065;&#x58EE;&#x6027;&#x3001;&#x65F6;&#x95F4;&#x6548;&#x7387;&#x9AD8;&#x3001;&#x5B58;&#x50A8;&#x91CF;&#x4F4E;</p>
<p><strong>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong></p>
<p>&#x51FD;&#x6570;&#x7684;&#x6E10;&#x8FD1;&#x589E;&#x957F;&#xFF1A;&#x7ED9;&#x5B9A;&#x4E24;&#x4E2A;&#x51FD;&#x6570;f(n)&#x548C;g(n)&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6574;&#x6570;N&#xFF0C;&#x4F7F;&#x5F97;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;n&gt;N&#xFF0C;f(n)&#x603B;&#x662F;&#x6BD4;g(n)&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;f(n)&#x7684;&#x589E;&#x957F;&#x6E10;&#x8FD1;&#x5FEB;&#x4E8E;g(n)</p>
<p>&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5E38;&#x6570;&#x548C;&#x5176;&#x4ED6;&#x6B21;&#x8981;&#x9879;&#x5E38;&#x5E38;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#xFF0C;&#x800C;&#x66F4;&#x5E94;&#x8BE5;&#x5173;&#x6CE8;&#x4E3B;&#x9879;&#xFF08;&#x6700;&#x9AD8;&#x9636;&#x9879;&#xFF09;&#x7684;&#x9636;&#x6570;</p>
<p>&#x67D0;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x968F;&#x7740;n&#x7684;&#x589E;&#x5927;&#xFF0C;&#x5B83;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x4F18;&#x4E8E;&#x53E6;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x6216;&#x8D8A;&#x6765;&#x8D8A;&#x5DEE;&#x4E8E;&#x53E6;&#x4E00;&#x7B97;&#x6CD5;</p>
<p>T(n)=O(f(n)) &#x8868;&#x793A;&#x968F;&#x95EE;&#x9898;&#x89C4;&#x6A21;n&#x7684;&#x589E;&#x5927;&#xFF0C;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x589E;&#x957F;&#x7387;&#x548C;f(n)&#x7684;&#x589E;&#x957F;&#x7387;&#x76F8;&#x540C;&#xFF0C;&#x79F0;&#x4F5C;&#x7B97;&#x6CD5;&#x7684;&#x6E10;&#x8FDB;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF08;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF09;</p>
<p>&#x63A8;&#x5BFC;&#x5927;O&#x9636;&#xFF1A;</p>
<ul>
<li>&#x7528;&#x5E38;&#x6570;1&#x53D6;&#x4EE3;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x52A0;&#x6CD5;&#x5E38;&#x6570;</li>
<li>&#x5728;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x8FD0;&#x884C;&#x6B21;&#x6570;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;&#x6700;&#x9AD8;&#x9636;&#x9879;</li>
<li>&#x5982;&#x679C;&#x6700;&#x9AD8;&#x9636;&#x9879;&#x5B58;&#x5728;&#x4E14;&#x4E0D;&#x662F;1&#xFF0C;&#x5219;&#x53BB;&#x9664;&#x4E0E;&#x8FD9;&#x4E2A;&#x9879;&#x76F8;&#x4E58;&#x7684;&#x5E38;&#x6570;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x5206;&#x652F;&#x7ED3;&#x6784;&#xFF0C;&#x6267;&#x884C;&#x6B21;&#x6570;&#x90FD;&#x662F;&#x6052;&#x5B9A;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x968F;n&#x7684;&#x53D8;&#x5927;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5355;&#x7EAF;&#x7684;&#x5206;&#x652F;&#x7ED3;&#x6784;&#xFF08;&#x4E0D;&#x5305;&#x542B;&#x5728;&#x5FAA;&#x73AF;&#x7ED3;&#x6784;&#x4E2D;&#xFF09;&#xFF0C;&#x5176;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x662F;O(1)</p>
<p>&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5173;&#x952E;&#x5C31;&#x662F;&#x5206;&#x6790;&#x5FAA;&#x73AF;&#x4F53;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;</p>
<p>&#x5E38;&#x6570;&#x9636;O(1)&#x3001;&#x7EBF;&#x6027;&#x9636;O(n)&#x3001;&#x5BF9;&#x6570;&#x9636;O(log<sub>2</sub>n)&#x3001;&#x5E73;&#x65B9;&#x9636;O(n<sup>2</sup>)</p>
<p>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#x6392;&#x5217;&#xFF1A;</p>
<p>O(1) &lt; O(logn) &lt; O(n) &lt; O(nlogn) &lt; O(n<sup>2</sup>) &lt; O(n<sup>3</sup>) &lt; O(2<sup>n</sup>) &lt; O(n!) &lt; O(n<sup>n</sup>)</p>
<p><strong>&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong></p>
<p>S(n)=O(f(n))&#xFF0C;n&#x4E3A;&#x95EE;&#x9898;&#x89C4;&#x6A21;&#xFF0C;f(n)&#x4E3A;&#x8BED;&#x53E5;&#x5173;&#x4E8E;n&#x6240;&#x5360;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x51FD;&#x6570;</p>
<p><strong>List</strong></p>
<p>&#x7EBF;&#x6027;&#x8868;&#xFF08;List&#xFF09;&#xFF1A;0&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x6709;&#x9650;&#x5E8F;&#x5217;</p>
<p>&#x5730;&#x5740;&#xFF1A;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x7684;&#x7F16;&#x53F7;</p>
<p><strong>&#x94FE;&#x8868;</strong></p>
<p>&#x7ED3;&#x70B9;&#xFF08;Node&#xFF09;&#xFF1A;&#x6570;&#x636E;&#x57DF;+&#x6307;&#x9488;&#x57DF;</p>
<p>&#x7EBF;&#x6027;&#x8868;&#x7684;&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF1A;n&#x4E2A;&#x7ED3;&#x70B9;&#x94FE;&#x7ED3;&#x6210;&#x4E00;&#x4E2A;&#x94FE;&#x8868;</p>
<p>&#x5355;&#x94FE;&#x8868;&#xFF1A;&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x57DF;</p>
<p>&#x5934;&#x6307;&#x9488;&#xFF1A;&#x94FE;&#x8868;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;</p>
<p>&#x5934;&#x7ED3;&#x70B9;&#xFF1A;&#x5355;&#x94FE;&#x8868;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x524D;&#x9644;&#x8BBE;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;</p>
<p>&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x6570;&#x636E;&#x8D8A;&#x9891;&#x7E41;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5355;&#x94FE;&#x8868;&#x7684;&#x6548;&#x7387;&#x4F18;&#x52BF;&#x5C31;&#x8D8A;&#x660E;&#x663E;</p>
<table>
<thead>
<tr>
<th>&#x7ED3;&#x6784;</th>
<th>&#x5B58;&#x50A8;&#x5206;&#x914D;&#x65B9;&#x5F0F;</th>
<th>&#x67E5;&#x627E;</th>
<th>&#x63D2;&#x5165;/&#x5220;&#x9664;</th>
<th>&#x7A7A;&#x95F4;&#x6027;&#x80FD;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x987A;&#x5E8F;&#x5B58;&#x50A8;</td>
<td>&#x7528;&#x4E00;&#x6BB5;&#x8FDE;&#x7EED;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x4F9D;&#x6B21;&#x5B58;&#x50A8;&#x7EBF;&#x6027;&#x8868;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;</td>
<td>O(1)</td>
<td>&#x5E73;&#x5747;&#x79FB;&#x52A8;&#x8868;&#x957F;&#x4E00;&#x534A;&#x7684;&#x5143;&#x7D20;&#xFF0C;O(n)</td>
<td>&#x9884;&#x5148;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;</td>
</tr>
<tr>
<td>&#x5355;&#x94FE;&#x8868;</td>
<td>&#x7528;&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x4E00;&#x7EC4;&#x4EFB;&#x610F;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x5B58;&#x653E;&#x7EBF;&#x6027;&#x8868;&#x7684;&#x5143;&#x7D20;</td>
<td>O(n)</td>
<td>&#x627E;&#x51FA;&#x67D0;&#x4F4D;&#x7F6E;&#x6307;&#x9488;&#x540E;&#xFF0C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x4E3A;O(1)</td>
<td>&#x4E0D;&#x9700;&#x8981;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;</td>
</tr>
</tbody>
</table>
<p><strong>&#x5FAA;&#x73AF;&#x94FE;&#x8868;</strong></p>
<p>&#x5FAA;&#x73AF;&#x94FE;&#x8868;&#xFF08;Circular Linkedlist&#xFF09;&#xFF1A;&#x5C06;&#x5355;&#x94FE;&#x8868;&#x4E2D;&#x7EC8;&#x7AEF;&#x7ED3;&#x70B9;&#x7684;&#x6307;&#x9488;&#x7AEF;&#x7531;&#x7A7A;&#x6307;&#x9488;&#x6539;&#x4E3A;&#x6307;&#x5411;&#x5934;&#x7ED3;&#x70B9;&#xFF0C;&#x4F7F;&#x6574;&#x4E2A;&#x5355;&#x94FE;&#x8868;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x73AF;</p>
<p>&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF1A;&#x7ED3;&#x70B9;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x76F4;&#x63A5;&#x540E;&#x7EE7;&#xFF0C;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x76F4;&#x63A5;&#x524D;&#x9A71;</p>
<p>&#x7EBF;&#x6027;&#x8868;</p>
<ul>
<li>&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;</li>
<li>&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;<ul>
<li>&#x5355;&#x94FE;&#x8868;</li>
<li>&#x9759;&#x6001;&#x94FE;&#x8868;</li>
<li>&#x5FAA;&#x73AF;&#x94FE;&#x8868;</li>
<li>&#x53CC;&#x5411;&#x94FE;&#x8868;</li>
</ul>
</li>
</ul>
<p><strong>&#x6808;</strong>&#xFF08;stack&#xFF09;&#xFF1A;&#x9650;&#x5B9A;&#x4EC5;&#x5728;&#x8868;&#x5C3E;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x7EBF;&#x6027;&#x8868;</p>
<p>&#x6808;&#x9876;&#xFF08;top&#xFF09;&#xFF1A;&#x5141;&#x8BB8;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x7684;&#x4E00;&#x7AEF;</p>
<p>&#x6808;&#x5E95;&#xFF08;bottom&#xFF09;</p>
<p>&#x540E;&#x8FDB;&#x5148;&#x51FA;&#xFF08;Last In First Out&#xFF09;</p>
<p>&#x6808;&#x7684;&#x63D2;&#x5165;&#x64CD;&#x4F5C;/&#x8FDB;&#x6808;/&#x538B;&#x6808;/&#x5165;&#x6808;</p>
<p>&#x6808;&#x7684;&#x5220;&#x9664;&#x64CD;&#x4F5C;/&#x51FA;&#x6808;/&#x5F39;&#x6808;</p>
<p>&#x6808;&#x7684;&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF08;&#x94FE;&#x6808;&#xFF09;</p>
<table>
<thead>
<tr>
<th>&#x6808;</th>
<th>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x987A;&#x5E8F;&#x6808;</td>
<td>O(1)</td>
<td>&#x9884;&#x5148;&#x786E;&#x5B9A;&#x957F;&#x5EA6;&#xFF0C;&#x8BFB;&#x53D6;&#x65B9;&#x4FBF;</td>
</tr>
<tr>
<td>&#x94FE;&#x6808;</td>
<td>O(1)</td>
<td>&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x6709;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x957F;&#x5EA6;&#x65E0;&#x9650;&#x5236;</td>
</tr>
</tbody>
</table>
<p>&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF1A;&#x4E00;&#x4E2A;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x6216;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x95F4;&#x63A5;&#x5730;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x51FD;&#x6570;</p>
<p>&#x6BCF;&#x4E2A;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x6EE1;&#x8DB3;&#x65F6;&#x9012;&#x5F52;&#x4E0D;&#x518D;&#x8FDB;&#x884C;&#xFF0C;&#x65E2;&#x4E0D;&#x518D;&#x5F15;&#x7528;&#x81EA;&#x8EAB;&#x800C;&#x662F;&#x8FD4;&#x56DE;&#x503C;&#x9000;&#x51FA;</p>
<p>&#x9006;&#x6CE2;&#x5170;&#xFF1A;&#x4E00;&#x79CD;&#x4E0D;&#x9700;&#x8981;&#x62EC;&#x53F7;&#x7684;&#x540E;&#x7F00;&#x8868;&#x8FBE;&#x6CD5;&#xFF0C;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x904D;&#x5386;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x548C;&#x7B26;&#x53F7;&#xFF0C;&#x9047;&#x5230;&#x6570;&#x5B57;&#x5C31;&#x8FDB;&#x6808;&#xFF0C;&#x9047;&#x5230;&#x7B26;&#x53F7;&#x5C31;&#x5C06;&#x6808;&#x9876;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x51FA;&#x6808;&#xFF0C;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x8FDB;&#x6808;&#xFF0C;&#x76F4;&#x5230;&#x83B7;&#x5F97;&#x7ED3;&#x679C;</p>
<p>&#x4E2D;&#x7F00;&#x8868;&#x8FBE;&#x5F0F;&#x8F6C;&#x540E;&#x7F00;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<p><strong>&#x961F;&#x5217;</strong></p>
<p>&#x961F;&#x5217;&#xFF08;queue&#xFF09;&#xFF1A;&#x53EA;&#x5141;&#x8BB8;&#x5728;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#xFF08;&#x961F;&#x5C3E;&#xFF09;&#xFF0C;&#x53E6;&#x4E00;&#x7AEF;&#x8FDB;&#x884C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#xFF08;&#x961F;&#x5934;&#xFF09;&#x7684;&#x7EBF;&#x6027;&#x8868;</p>
<p>&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;First In First Out&#xFF09;</p>
<p>&#x4E32;&#xFF08;string&#xFF09;&#xFF1A;&#x7531;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#x7684;&#x6709;&#x9650;&#x5E8F;&#x5217;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;</p>
<p>&#x4E32;&#x7684;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF1A;&#x5B50;&#x4E32;&#x7684;&#x5B9A;&#x4F4D;&#x64CD;&#x4F5C;</p>
<p>KMP&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7B97;&#x6CD5;&#xFF1A;</p>
<p><strong>&#x6811;</strong></p>
<p>Tree&#xFF1A;&#x662F;n&#x4E2A;(n&gt;=0)&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x6709;&#x9650;&#x96C6;&#x3002;n=0&#x65F6;&#x4E3A;&#x7A7A;&#x6811;&#x3002;&#x4EFB;&#x610F;&#x4E00;&#x68F5;&#x975E;&#x7A7A;&#x6811;&#x79CD;&#xFF1A;(1)&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8DDF;&#x7ED3;&#x70B9;(Root);(2)&#x5F53;n&gt;1&#x65F6;&#xFF0C;&#x5176;&#x4F59;&#x7ED3;&#x70B9;&#x53EF;&#x5206;&#x4E3A;m(m&gt;0)&#x4E2A;&#x4E92;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;&#x6709;&#x9650;&#x96C6;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x672C;&#x8EAB;&#x53C8;&#x662F;&#x4E00;&#x68F5;&#x6811;&#xFF0C;&#x5E76;&#x4E14;&#x6210;&#x4E3A;&#x6839;&#x7684;&#x5B50;&#x6811;(SubTree)</p>
<p>&#x7ED3;&#x70B9;&#x7684;&#x5EA6;(Degree)&#xFF1A;&#x7ED3;&#x70B9;&#x62E5;&#x6709;&#x7684;&#x5B50;&#x6811;&#x6570;</p>
<p>&#x53F6;(Leaf)/&#x7EC8;&#x7AEF;&#x70B9;&#xFF1A;Degree=0&#x7684;&#x7ED3;&#x70B9;</p>
<p>&#x975E;&#x7EC8;&#x7AEF;&#x70B9;/&#x5206;&#x652F;&#x7ED3;&#x70B9;&#xFF1A;Degree!=0&#x7684;&#x7ED3;&#x70B9;&#xFF0C;&#x9664;&#x4E86;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x4E5F;&#x53EB;&#x5185;&#x90E8;&#x7ED3;&#x70B9;</p>
<p>&#x6811;&#x7684;&#x5EA6;&#xFF1A;&#x6811;&#x5185;&#x5404;&#x7ED3;&#x70B9;&#x7684;&#x5EA6;&#x7684;&#x6700;&#x5927;&#x503C;</p>
<p>&#x7ED3;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF1A;Child, Parent, Sibling</p>
<p>&#x7ED3;&#x70B9;&#x7684;&#x5C42;&#x6B21;(Level)&#xFF1A;&#x4ECE;&#x6839;&#x5F00;&#x59CB;&#x5B9A;&#x4E49;&#x8D77;&#xFF0C;&#x6839;&#x4E3A;&#x7B2C;&#x4E00;&#x5C42;</p>
<p>&#x6811;&#x7684;&#x6DF1;&#x5EA6;(Depth)/&#x9AD8;&#x5EA6;&#xFF1A;&#x6811;&#x4E2D;&#x7ED3;&#x70B9;&#x7684;&#x6700;&#x5927;&#x5C42;&#x6B21;</p>
<p>&#x6709;&#x5E8F;&#x6811;&#xFF1A;&#x5C06;&#x6811;&#x4E2D;&#x7ED3;&#x70B9;&#x7684;&#x5404;&#x5B50;&#x6811;&#x770B;&#x6210;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x662F;&#x6709;&#x6B21;&#x5E8F;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x4E92;&#x6362;</p>
<p>&#x7279;&#x6B8A;&#x4E8C;&#x53C9;&#x6811;&#xFF1A;&#x659C;&#x6811;&#x3001;&#x6EE1;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x5B8C;&#x5168;&#x4E8C;&#x53C9;&#x6811;</p>
<p>&#x4E8C;&#x53C9;&#x6811;&#x904D;&#x5386;&#xFF1A;</p>
<ul>
<li>&#x524D;&#x5E8F;&#x904D;&#x5386;&#xFF1A;&#x8BBF;&#x95EE;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x5148;&#x904D;&#x5386;&#x5DE6;&#x5B50;&#x6811;&#xFF0C;&#x518D;&#x904D;&#x5386;&#x53F3;&#x5B50;&#x6811;</li>
<li>&#x4E2D;&#x5E8F;&#x904D;&#x5386;</li>
<li>&#x540E;&#x5E8F;&#x904D;&#x5386;</li>
<li>&#x5C42;&#x5E8F;&#x904D;&#x5386;</li>
</ul>
<p>&#x5DF2;&#x77E5;&#x524D;&#x5E8F;&#x904D;&#x5E8F;&#x5217;&#x548C;&#x4E2D;&#x5E8F;&#x904D;&#x5386;&#x5E8F;&#x5217;&#xFF0C;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x4E00;&#x68F5;&#x4E8C;&#x53C9;&#x6811;</p>
<p>&#x5DF2;&#x77E5;&#x540E;&#x5E8F;&#x904D;&#x5E8F;&#x5217;&#x548C;&#x4E2D;&#x5E8F;&#x904D;&#x5386;&#x5E8F;&#x5217;&#xFF0C;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x4E00;&#x68F5;&#x4E8C;&#x53C9;&#x6811;</p>
<h3 id="sort">sort</h3>
<p><strong>&#x7A33;&#x5B9A;</strong>&#xFF1A;&#x5982;&#x679C;a&#x539F;&#x672C;&#x5728;b&#x524D;&#x9762;&#xFF0C;&#x800C;a=b&#xFF0C;&#x6392;&#x5E8F;&#x4E4B;&#x540E;a&#x4ECD;&#x7136;&#x5728;b&#x7684;&#x524D;&#x9762;&#xFF1B; </p>
<p><strong>&#x4E0D;&#x7A33;&#x5B9A;</strong>&#xFF1A;&#x5982;&#x679C;a&#x539F;&#x672C;&#x5728;b&#x7684;&#x524D;&#x9762;&#xFF0C;&#x800C;a=b&#xFF0C;&#x6392;&#x5E8F;&#x4E4B;&#x540E;a&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x5728;b&#x7684;&#x540E;&#x9762;&#xFF1B;</p>
<p><strong>&#x5185;&#x6392;&#x5E8F;</strong>&#xFF1A;&#x6240;&#x6709;&#x6392;&#x5E8F;&#x64CD;&#x4F5C;&#x90FD;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B8C;&#x6210;&#xFF1B; </p>
<p><strong>&#x5916;&#x6392;&#x5E8F;</strong>&#xFF1A;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x592A;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x628A;&#x6570;&#x636E;&#x653E;&#x5728;&#x78C1;&#x76D8;&#x4E2D;&#xFF0C;&#x800C;&#x6392;&#x5E8F;&#x901A;&#x8FC7;&#x78C1;&#x76D8;&#x548C;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#xFF1B;</p>
<p><strong>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>: &#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x6240;&#x8017;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x3002; </p>
<p><strong>&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>: &#x8FD0;&#x884C;&#x5B8C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p><img width="88%" src="https://user-gold-cdn.xitu.io/2016/11/29/4abde1748817d7f35f2bf8b6a058aa40?imageView2/0/w/1280/h/960/ignore-error/1"> </p>
<p> n: &#x6570;&#x636E;&#x89C4;&#x6A21; k:&#x201C;&#x6876;&#x201D;&#x7684;&#x4E2A;&#x6570;</p>
<p>In-place: &#x5360;&#x7528;&#x5E38;&#x6570;&#x5185;&#x5B58;&#xFF0C;&#x4E0D;&#x5360;&#x7528;&#x989D;&#x5916;&#x5185;&#x5B58;</p>
<p>Out-place: &#x5360;&#x7528;&#x989D;&#x5916;&#x5185;&#x5B58;</p>
<p>&#x5192;&#x6CE1;&#x6392;&#x5E8F;</p>
<p><img width="70%" src="https://user-gold-cdn.xitu.io/2016/11/30/f427727489dff5fcb0debdd69b478ecf?imageView2/0/w/1280/h/960/ignore-error/1"></p>
<p>&#x9009;&#x62E9;&#x6392;&#x5E8F;</p>
<p><img width="70%" src="https://user-gold-cdn.xitu.io/2016/11/29/138a44298f3693e3fdd1722235e72f0f?imageView2/0/w/1280/h/960/ignore-error/1"></p>
<p>&#x63D2;&#x5165;&#x6392;&#x5E8F;</p>
<p><img width="70%" src="https://user-gold-cdn.xitu.io/2016/11/29/f0e1e3b7f95c3888ab2791b6abbfae41?imageView2/0/w/1280/h/960/ignore-error/1"></p>
<p>&#x5F52;&#x5E76;&#x6392;&#x5E8F;</p>
<p><img width="70%" src="https://user-gold-cdn.xitu.io/2016/11/29/33d105e7e7e9c60221c445f5684ccfb6?imageView2/0/w/1280/h/960/ignore-error/1"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="git.html" class="navigation navigation-prev " aria-label="Previous page: Git">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="http.html" class="navigation navigation-next " aria-label="Next page: Http">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Data Structure","level":"2.2","depth":1,"next":{"title":"Http","level":"2.3","depth":1,"path":"post/http.md","ref":"post/http.md","articles":[]},"previous":{"title":"Git","level":"2.1","depth":1,"path":"post/git.md","ref":"post/git.md","articles":[]},"dir":"ltr"},"config":{"plugins":["page-treeview","splitter"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"page-treeview":{"copyright":"Copyright © aleen42","minHeaderCount":"1","minHeaderDeep":"1"},"splitter":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Jamie","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Jamie House","gitbook":"*","description":"V5"},"file":{"path":"post/dataStructure.md","mtime":"2019-02-24T04:00:25.341Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-20T16:16:16.349Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

