
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>打更那些事 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../linux/">
            
                <a href="../linux/">
            
                    
                    Linux
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../linux/command.html">
            
                <a href="../linux/command.html">
            
                    
                    Command
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../linux/shortcut.html">
            
                <a href="../linux/shortcut.html">
            
                    
                    Shortcut
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../linux/devenv.html">
            
                <a href="../linux/devenv.html">
            
                    
                    DevEnv
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../tool/">
            
                <a href="../tool/">
            
                    
                    Tool
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../tool/vscode.html">
            
                <a href="../tool/vscode.html">
            
                    
                    VSCode
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../tool/eclipse.html">
            
                <a href="../tool/eclipse.html">
            
                    
                    Eclipse
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../nodejs/">
            
                <a href="../nodejs/">
            
                    
                    NodeJS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../nodejs/npm.html">
            
                <a href="../nodejs/npm.html">
            
                    
                    NPM
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../devops/">
            
                <a href="../devops/">
            
                    
                    DevOps
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../devops/docker.html">
            
                <a href="../devops/docker.html">
            
                    
                    Docker
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="./">
            
                <a href="./">
            
                    
                    更夫
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="dageng.html">
            
                <a href="dageng.html">
            
                    
                    打更那些事
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >打更那些事</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6253;&#x66F4;&#x90A3;&#x4E9B;&#x4E8B;">&#x6253;&#x66F4;&#x90A3;&#x4E9B;&#x4E8B;</h1>
<h3 id="2016-3-9-0141">2016-3-9 01:41</h3>
<h4 id="&#x90A3;&#x4E00;&#x5E74;&#xFF0C;&#x6751;&#x91CC;&#x95F9;&#x9965;&#x8352;&#x3002;&#x66F4;&#x592B;&#x9976;&#x6709;&#x5174;&#x81F4;&#xFF0C;&#x8E29;&#x7740;&#x5355;&#x8F66;&#x5C31;&#x98DE;&#x5230;&#x6751;&#x53E3;&#x6CB3;&#x8FB9;&#xFF0C;&#x635E;&#x8D77;&#x51E0;&#x5757;&#x91D1;&#x9EC4;&#x5149;&#x6ED1;&#x7684;&#x77F3;&#x5B50;&#xFF0C;&#x968F;&#x624B;&#x6478;&#x4E86;&#x51E0;&#x5757;&#x68FA;&#x6728;&#xFF0C;&#x628A;&#x77F3;&#x5B50;&#x70E7;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x516B;&#x6210;&#x719F;&#xFF01;&#x638F;&#x51FA;&#x81EA;&#x5BB6;&#x5236;&#x7684;&#x72EC;&#x95E8;&#x9171;&#x6CB9;&#xFF0C;&#x9ED1;&#x5F97;&#x53D1;&#x4EAE;&#xFF0C;&#x9171;&#x6CB9;&#x91CC;&#x4F9D;&#x7A00;&#x5012;&#x5F71;&#x51FA;&#x6751;&#x53E3;&#x73A9;&#x800D;&#x65F6;&#x65E5;&#x5B50;&#xFF0C;&#x53EA;&#x662F;&#x8001;&#x7684;&#x8001;&#xFF0C;&#x53BB;&#x7684;&#x53BB;&#x3002;&#x6BEB;&#x4E0D;&#x541D;&#x556C;&#xFF0C;&#x70B9;&#x4E86;&#x9171;&#x6CB9;&#x5F80;&#x53E3;&#x91CC;&#x585E;&#xFF0C;&#x70EB;&#x662F;&#x70EB;&#xFF0C;&#x4E0D;&#x8FC7;&#x81EA;&#x4ECE;&#x820C;&#x5934;&#x88AB;&#x54AC;&#x65AD;&#x540E;&#xFF0C;&#x8D8A;&#x662F;&#x81EA;&#x5F97;&#x5176;&#x4E50;&#x3002;">&#x90A3;&#x4E00;&#x5E74;&#xFF0C;&#x6751;&#x91CC;&#x95F9;&#x9965;&#x8352;&#x3002;&#x66F4;&#x592B;&#x9976;&#x6709;&#x5174;&#x81F4;&#xFF0C;&#x8E29;&#x7740;&#x5355;&#x8F66;&#x5C31;&#x98DE;&#x5230;&#x6751;&#x53E3;&#x6CB3;&#x8FB9;&#xFF0C;&#x635E;&#x8D77;&#x51E0;&#x5757;&#x91D1;&#x9EC4;&#x5149;&#x6ED1;&#x7684;&#x77F3;&#x5B50;&#xFF0C;&#x968F;&#x624B;&#x6478;&#x4E86;&#x51E0;&#x5757;&#x68FA;&#x6728;&#xFF0C;&#x628A;&#x77F3;&#x5B50;&#x70E7;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x516B;&#x6210;&#x719F;&#xFF01;&#x638F;&#x51FA;&#x81EA;&#x5BB6;&#x5236;&#x7684;&#x72EC;&#x95E8;&#x9171;&#x6CB9;&#xFF0C;&#x9ED1;&#x5F97;&#x53D1;&#x4EAE;&#xFF0C;&#x9171;&#x6CB9;&#x91CC;&#x4F9D;&#x7A00;&#x5012;&#x5F71;&#x51FA;&#x6751;&#x53E3;&#x73A9;&#x800D;&#x65F6;&#x65E5;&#x5B50;&#xFF0C;&#x53EA;&#x662F;&#x8001;&#x7684;&#x8001;&#xFF0C;&#x53BB;&#x7684;&#x53BB;&#x3002;&#x6BEB;&#x4E0D;&#x541D;&#x556C;&#xFF0C;&#x70B9;&#x4E86;&#x9171;&#x6CB9;&#x5F80;&#x53E3;&#x91CC;&#x585E;&#xFF0C;&#x70EB;&#x662F;&#x70EB;&#xFF0C;&#x4E0D;&#x8FC7;&#x81EA;&#x4ECE;&#x820C;&#x5934;&#x88AB;&#x54AC;&#x65AD;&#x540E;&#xFF0C;&#x8D8A;&#x662F;&#x81EA;&#x5F97;&#x5176;&#x4E50;&#x3002;</h4>
<h3 id="2016-3-10-0314">2016-3-10 03:14</h3>
<pre><code>&#x5929;&#x5DF2;&#x5927;&#x4EAE;&#xFF0C;&#x66F4;&#x592B;&#x8D70;&#x4E0D;&#x52A8;&#x4E86;&#xFF0C;&#x6251;&#x5728;&#x6CE5;&#x6C34;&#x4E0A;&#xFF0C;&#x559C;&#x6B22;&#x505A;&#x68A6;&#x7684;&#x4ED6;&#x53C8;&#x770B;&#x5230;&#x8DEF;&#x4EBA;&#x8FC7;&#x5F80;&#xFF0C;&#x65E0;&#x6CD5;&#x8BB0;&#x4F4F;&#x7684;&#x8138;&#x5B54;&#xFF0C;&#x7761;&#x5F97;&#x53EF;&#x9999;&#xFF01;&#x8F70;&#x9686;&#x8F70;&#x9686;&#xFF0C;&#x6C34;&#x6CE5;&#x4E00;&#x6CFB;&#x800C;&#x4E0B;&#xFF0C;&#x5077;&#x5077;&#x85CF;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x5728;&#x8FD9;&#x665A;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x6C89;&#x7761;&#x5728;&#x9ED1;&#x591C;&#x91CC;&#xFF0C;&#x800C;&#x4ED6;&#x5E26;&#x7740;&#x5FAE;&#x7B11;&#xFF0C;&#x544A;&#x522B;&#x4E86;&#x4E00;&#x5EA7;&#x57CE;&#x5E02;&#x3002; &#x200B;&#x200B;&#x200B;&#x200B;
</code></pre><h3 id="2016-3-10-2146">2016-3-10 21:46</h3>
<pre><code>&#x9C7C;&#x5858;&#x8FB9;&#xFF0C;&#x66F4;&#x592B;&#x7761;&#x8D77;&#x5348;&#x89C9;&#xFF0C;&#x96E8;&#x540E;&#x8349;&#x6E05;&#x9999;&#xFF0C;&#x86AF;&#x8693;&#x8E0A;&#x8DC3;&#x671D;&#x4ED6;&#x8EAB;&#x4E0A;&#x722C;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x80FD;&#x722C;&#x8FDB;&#x4ED6;&#x773C;&#x775B;&#x91CC;&#x3002;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#xFF01;&#x89D2;&#x843D;&#x8150;&#x9C7C;&#xFF0C;&#x86C6;&#x866B;&#x5356;&#x5F04;&#x8EAB;&#x59FF;&#xFF0C;&#x6D3B;&#x5F97;&#x597D;&#x4E0D;&#x6ECB;&#x6DA6;&#x3002;&#x968F;&#x7740;&#x9633;&#x5149;&#x84B8;&#x53D1;&#x4EBA;&#x95F4;&#xFF0C;&#x4EE4;&#x4EBA;&#x5FC3;&#x60B8;&#x7684;&#x6C14;&#x5473;&#x89E6;&#x624B;&#x53EF;&#x53CA;&#xFF0C;&#x9192;&#x6765;&#x7684;&#x4ED6;&#x4E2D;&#x6BD2;&#x4F3C;&#x7684;&#xFF0C;&#x8FF7;&#x8FF7;&#x660F;&#x660F;&#x5730;&#x8DF3;&#x4E86;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x65F6;&#x9C7C;&#x513F;&#x5728;&#x5BFB;&#x627E;&#x4E0D;&#x77E5;&#x8DD1;&#x5230;&#x54EA;&#x91CC;&#x7684;&#x86AF;&#x8693;&#x548C;&#x5B83;&#x88F9;&#x7740;&#x7684;&#x773C;&#x7403;&#x3002;
</code></pre><h3 id="2016-3-11-0102">2016-3-11 01:02</h3>
<pre><code>&#x8D76;&#x5728;&#x5929;&#x9ED1;&#x524D;&#xFF0C;&#x67F4;&#x706B;&#x545B;&#x51FA;&#x4E00;&#x6EF4;&#x53C8;&#x4E00;&#x6EF4;&#x7684;&#x6CEA;&#x6C34;&#xFF0C;&#x4ED6;&#x675F;&#x7D27;&#x4E86;&#x88E4;&#x5E26;&#xFF0C;&#x8DEA;&#x5728;&#x5730;&#x4E0A;&#xFF0C;&#x9739;&#x96F3;&#x9739;&#x96F3;&#xFF0C;&#x6C99;&#x5B50;&#x5728;&#x9505;&#x91CC;&#x6B22;&#x60A6;&#x8DF3;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8DF3;&#x5230;&#x4ED6;&#x7A7A;&#x8361;&#x7684;&#x8089;&#x4F53;&#x3002;&#x63D0;&#x8D77;&#x4E86;&#x7CBE;&#x795E;&#xFF0C;&#x79BB;&#x5F00;&#x4E86;&#x7076;&#x53F0;&#xFF0C;&#x64E6;&#x5E72;&#x4E86;&#x6CEA;&#x6C34;&#xFF0C;&#x74E2;&#x8D77;&#x4E86;&#x4E95;&#x6C34;&#x3002;&#x8138;&#x8089;&#x6A21;&#x7CCA;&#xFF01;&#x4E94;&#x5B98;&#x4E0D;&#x4E00;&#x4E00;&#x7EC6;&#x6570;&#x3002;&#x96F7;&#x9E23;&#x8F70;&#x54CD;&#xFF0C;&#x66F4;&#x592B;&#x8D8A;&#x662F;&#x81EA;&#x4FE1;&#x3002;&#x8E0F;&#x6B65;&#x81F3;&#x623F;&#x95F4;&#xFF0C;&#x6807;&#x81F4;&#x6781;&#x4E86;&#xFF0C;&#x5BF9;&#x8131;&#x4E0B;&#x7684;&#x76AE;&#xFF0C;&#x4EFB;&#x610F;&#x6CFC;&#x6D12;&#x6325;&#x970D;&#x58A8;&#x6C34;&#xFF0C;&#x53C8;&#x4E00;&#x5F20;&#x4E2A;&#x6027;&#x8138;&#x76AE;&#x3002;
</code></pre><h3 id="2016-3-11-2229">2016-3-11 22:29</h3>
<pre><code>&#x4ED6;&#x53C8;&#x9F13;&#x8D77;&#x5E72;&#x52B2;&#xFF0C;&#x8FD9;&#x4E0B;&#x597D;&#x4E86;&#xFF0C;&#x767D;&#x5929;&#x90FD;&#x4E0D;&#x7761;&#x89C9;&#x4E86;&#xFF0C;&#x8BF4;&#x662F;&#x8981;&#x7EC3;&#x529F;&#x592B;&#x3002;&#x8FD9;&#x5929;&#x4ED6;&#x5230;&#x9547;&#x4E0A;&#xFF0C;&#x4E00;&#x4EBA;&#x4E00;&#x97AD;&#x4E00;&#x7EF3;&#x7275;&#x4E00;&#x7334;&#xFF0C;&#x4ED6;&#x770B;&#x5F97;&#x773C;&#x73E0;&#x90FD;&#x6389;&#x4E0B;&#x6765;&#x4E86;&#x3002;&#x5728;&#x56DE;&#x5BB6;&#x8DEF;&#x4E0A;&#x800D;&#x5F97;&#x50CF;&#x7334;&#x6709;&#x51E0;&#x5206;&#xFF0C;&#x9694;&#x58C1;&#x738B;&#x5927;&#x5988;&#x4E50;&#x9053;&#xFF1A;&#x201C;&#x6CFC;&#x7334;&#xFF0C;&#x7ED9;&#x8001;&#x5A18;&#x77A7;&#x77A7;&#x4F60;&#x7684;&#x91D1;&#x7B8D;&#x68D2;&#xFF01;&#x201D;&#x66F4;&#x592B;&#x8D8A;&#x53D1;&#x5F97;&#x610F;&#xFF0C;&#x8D8A;&#x5F97;&#x610F;&#x8138;&#x76AE;&#x8D8A;&#x662F;&#x62BD;&#x6410;&#xFF0C;&#x80F8;&#x808B;&#x9AA8;&#x556A;&#x556A;&#x556A;&#xFF0C;&#x65AD;&#x4E86;&#x597D;&#x51E0;&#x6761;&#xFF01;&#x8FD9;&#x665A;&#x6697;&#x4E0B;&#x51B3;&#x5FC3;&#xFF0C;&#x7EC3;&#x529F;&#x592B;&#xFF01;&#x5410;&#x53E3;&#x9C9C;&#x8840;&#x53C8;&#x4E00;&#x53E3;
</code></pre><h3 id="2016-3-12-1902">2016-3-12 19:02</h3>
<pre><code>&#x9664;&#x4E86;&#x70DF;&#x9152;&#xFF0C;&#x5C4B;&#x91CC;&#x522B;&#x65E0;&#x4ED6;&#x7269;&#x3002;&#x559D;&#x5F97;&#x5174;&#x4E4B;&#x6240;&#x81F3;&#xFF0C;&#x5201;&#x6839;&#x70DF;&#xFF0C;&#x7529;&#x7740;&#x8FAB;&#x5B50;&#x4E0A;&#x5C97;&#x53BB;&#x3002;&#x4E07;&#x5BB6;&#x706F;&#x706B;&#xFF0C;&#x7A7A;&#x8361;&#x7684;&#x8857;&#x4E0A;&#x51B0;&#x51B7;&#x51B7;&#xFF0C;&#x96BE;&#x514D;&#x4F7F;&#x4EBA;&#x843D;&#x5BDE;&#xFF0C;&#x4ED6;&#x5374;&#x4E0D;&#x4EE5;&#x4E3A;&#x7136;&#xFF0C;&#x4ED6;&#x65E9;&#x4EE5;&#x4E60;&#x60EF;&#x62C5;&#x60CA;&#x53D7;&#x6015;&#x3002;&#x6536;&#x655B;&#x4E86;&#x7B11;&#x610F;&#xFF0C;&#x9EBB;&#x75F9;&#x6728;&#x7136;&#xFF01;&#x7A7F;&#x8857;&#x8FC7;&#x5DF7;&#xFF0C;&#x9ED1;&#x591C;&#x4E2D;&#x7684;&#x72D7;&#x773C;&#x77AA;&#x5F97;&#x5927;&#x5927;&#xFF0C;&#x76EE;&#x4E0D;&#x8F6C;&#x775B;&#xFF0C;&#x4EBA;&#x6027;&#x5149;&#x8F89;&#x554A;&#xFF01;&#x66F4;&#x592B;&#x53C8;&#x638F;&#x51FA;&#x4E00;&#x6839;&#x70DF;&#xFF0C;&#x57CB;&#x6CA1;&#x5728;&#x9ED1;&#x591C;&#x91CC;&#xFF0C;&#x5C4B;&#x91CC;&#x7684;&#x4E91;&#x96E8;&#x65E9;&#x5DF2;&#x4E0E;&#x4ED6;&#x65E0;&#x5173;&#x3002;
</code></pre><h3 id="2016-3-13-1340">2016-3-13 13:40</h3>
<pre><code>&#x51AC;&#x65E5;&#x91CC;&#x7684;&#x4E00;&#x7F15;&#x9633;&#x5149;&#xFF0C;&#x4ED6;&#x6C14;&#x5598;&#x5401;&#x5401;&#xFF0C;&#x53E3;&#x5E72;&#x820C;&#x71E5;&#xFF0C;&#x5F00;&#x5F80;&#x672A;&#x77E5;&#xFF0C;&#x6D88;&#x5931;&#x5728;&#x8DEF;&#x7684;&#x5C3D;&#x5934;&#x3002;&#x8EBA;&#x5728;&#x8F66;&#x4E0A;&#xFF0C;&#x56DE;&#x5473;&#x8FD9;&#x4E9B;&#x5E74;&#x8FFD;&#x9010;&#x7684;&#x5149;&#x666F;&#xFF0C;&#x4F3C;&#x68A6;&#x4F3C;&#x5E7B;&#x3002;&#x546F;&#x546F;&#x78B0;&#x78B0;&#xFF01;&#x540A;&#x74F6;&#x4E92;&#x76F8;&#x6FC0;&#x78B0;&#xFF0C;&#x800C;&#x4ED6;&#x5728;&#x6DF1;&#x6D77;&#x4E0E;&#x6F5C;&#x610F;&#x8BC6;&#x8FA9;&#x8BBA;&#xFF0C;&#x8DB3;&#x591F;&#x7684;REM&#x7761;&#x7720;&#xFF0C;&#x8BA9;&#x66F4;&#x592B;&#x634F;&#x9020;&#x4E86;&#x65E0;&#x6570;&#x5EFA;&#x7B51;&#x3002;&#x800C;&#x6700;&#x6DF1;&#x5904;&#xFF0C;&#x59CB;&#x7EC8;&#x6709;&#x95F4;&#x94FA;&#x6EE1;&#x7070;&#x5C18;&#x6697;&#x6DE1;&#x65E0;&#x5149;&#x7684;&#x5C0F;&#x5C4B;&#xFF0C;&#x85CF;&#x7740;&#x539F;&#x59CB;&#x7684;&#x8BB0;&#x5FC6;&#x788E;&#x7247;&#xFF0C;&#x6298;&#x5C04;&#x51FA;&#x7AE5;&#x5E74;&#x7684;&#x661F;&#x5149;&#x3002;&#x6050;&#x60E7;&#xFF01;
</code></pre><h3 id="2018&#x5E74;01&#x6708;02&#x65E5;-&#x665A;&#x4E0A;1004">2018&#x5E74;01&#x6708;02&#x65E5; &#x665A;&#x4E0A;10:04</h3>
<pre><code>&#x78A7;&#x6D77;
&#x84DD;&#x5929;
&#x6D77;&#x9E25;
&#x6CE2;&#x6D6A;
&#x6DF1;&#x6D77;
&#x98CE;&#x6C99;
&#x6E05;&#x6668;
</code></pre><h3 id="2018&#x5E74;01&#x6708;08&#x65E5;-&#x534A;&#x591C;1241">2018&#x5E74;01&#x6708;08&#x65E5; &#x534A;&#x591C;12:41</h3>
<pre><code>&#x6E5B;&#x84DD;&#x7684;&#x5929;&#x7A7A;&#x4E0B;
&#x5B88;&#x62A4;&#x7740;&#x91D1;&#x9EC4;&#x7684;&#x9EA6;&#x7530;
&#x53C8;&#x6216;
&#x6DF1;&#x5E7D;&#x7684;&#x5927;&#x6D77;&#x91CC;
&#x6C89;&#x6D78;&#x5728;&#x9ED1;&#x8272;&#x7684;&#x5BC2;&#x9759;
</code></pre><h3 id="2018&#x5E74;02&#x6708;06&#x65E5;-&#x51CC;&#x6668;136">2018&#x5E74;02&#x6708;06&#x65E5; &#x51CC;&#x6668;1:36</h3>
<pre><code>Inner peace,your heart,wonderland.
The light shooting my mind,meaning my light return.
</code></pre><h3 id="2018&#x5E74;03&#x6708;31&#x65E5;-&#x51CC;&#x6668;150">2018&#x5E74;03&#x6708;31&#x65E5; &#x51CC;&#x6668;1:50</h3>
<pre><code>&#x94C1;&#x9A6C;&#x51B0;&#x6CB3;&#xFF0C;&#x5E7D;&#x6709;&#x6697;&#x9B42;&#x9999;
</code></pre><h3 id="2018&#x5E74;04&#x6708;08&#x65E5;-&#x665A;&#x4E0A;722">2018&#x5E74;04&#x6708;08&#x65E5; &#x665A;&#x4E0A;7:22</h3>
<pre><code>&#x7A7A;&#x8361;&#x7684;&#x8857;&#x5DF7;&#x91CC;&#xFF0C;&#x4EC5;&#x6709;&#x4E00;&#x4E1D;&#x5FAE;&#x4E0D;&#x53EF;&#x5BDF;&#x7684;&#x5E7D;&#x5149;&#xFF0C;&#x8DEF;&#x9762;&#x6F6E;&#x6E7F;&#x9634;&#x6697;&#xFF0C;&#x66F4;&#x592B;&#x63D0;&#x7740;&#x4ED6;&#x7684;&#x706F;&#x7B3C;&#xFF0C;&#x9690;&#x85CF;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x89D2;&#x843D;&#xFF0C;&#x7B49;&#x5F85;&#x7740;&#x7684;&#x662F;&#xFF0C;&#x6C38;&#x4E0D;&#x5230;&#x6765;&#x7684;&#x9ECE;&#x660E;&#x3002;
</code></pre><h3 id="2018&#x5E74;04&#x6708;14&#x65E5;-&#x534A;&#x591C;1158">2018&#x5E74;04&#x6708;14&#x65E5; &#x534A;&#x591C;11:58</h3>
<pre><code>&#x62BC;&#x5C3E;&#x6851;&#x8BF4;&#x5F39;&#x98CE;&#x4E4B;&#x8BD7;&#x7684;&#x65F6;&#x5019;&#x60F3;&#x8C61;&#x7740;&#x8FBD;&#x9614;&#x7684;&#x8349;&#x539F;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x4F1A;&#x7AD9;&#x5728;&#x91D1;&#x9EC4;&#x7684;&#x9EA6;&#x7530;&#x91CC;&#xFF0C;&#x90A3;&#x4E2A;&#x8EAB;&#x540E;&#x5C31;&#x662F;&#x6DF1;&#x6E0A;&#x7684;&#x9EA6;&#x7530;&#xFF0C;&#x505A;&#x4E00;&#x540D;&#x5B88;&#x671B;&#x8005;&#xFF0C;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x8DDF;&#x90A3;&#x4E2A;&#x53EB;&#x970D;&#x5C14;&#x987F;&#x7684;&#x5BB6;&#x4F19;&#x5DEE;&#x4E0D;&#x591A;&#x3002;
</code></pre><h3 id="2018&#x5E74;04&#x6708;16&#x65E5;-&#x534A;&#x591C;1159">2018&#x5E74;04&#x6708;16&#x65E5; &#x534A;&#x591C;11:59</h3>
<pre><code>&#x5370;&#x8C61;&#x519C;&#x6C11;
&#x4E00;&#x8EAB;&#x53E4;&#x94DC;&#x76AE;&#x80A4;
&#x4E00;&#x624B;&#x8001;&#x8327;
&#x780D;&#xFF0C;&#x5339;&#xFF0C;&#x5272;&#xFF0C;&#x9504;&#xFF0C;&#x62D4;&#xFF0C;&#x6316;
</code></pre><h3 id="2018&#x5E74;04&#x6708;18&#x65E5;-&#x534A;&#x591C;1204">2018&#x5E74;04&#x6708;18&#x65E5; &#x534A;&#x591C;12:04</h3>
<pre><code>&#x6CBF;&#x8DEF;&#x9713;&#x8679;&#x76F8;&#x4EA4;&#x8F89;&#x6620;&#xFF0C;&#x6765;&#x5F80;&#x5DDD;&#x6D41;&#x4E0D;&#x606F;&#xFF0C;&#x71E5;&#x95F9;&#x66F4;&#x663E;&#x5F97;&#x9759;&#x8C27;&#xFF0C;&#x53EA;&#x7BA1;&#x6CE8;&#x89C6;&#x7740;&#x6B63;&#x524D;&#x65B9;&#xFF0C;&#x4E5F;&#x4E0D;&#x6E05;&#x695A;&#x770B;&#x4E2A;&#x4EC0;&#x4E48;&#xFF0C;&#x6162;&#x6162;&#x773C;&#x8FB9;&#x5931;&#x53BB;&#x7126;&#x70B9;&#xFF0C;&#x4E16;&#x754C;&#x6742;&#x7CC5;&#x6210;&#x4E00;&#x56E2;&#x9EBB;&#x82B1;&#x3002;
</code></pre><h3 id="2018&#x5E74;04&#x6708;18&#x65E5;-&#x534A;&#x591C;1213">2018&#x5E74;04&#x6708;18&#x65E5; &#x534A;&#x591C;12:13</h3>
<pre><code>&#x5E74;&#x5C11;&#x77E5;&#x6101;&#x65E0;&#x5904;&#x89E3;&#xFF0C;&#x591C;&#x534A;&#x6500;&#x53F0;&#x6708;&#x4E0B;&#x601D;
</code></pre><h3 id="2018&#x5E74;04&#x6708;21&#x65E5;-&#x51CC;&#x6668;138">2018&#x5E74;04&#x6708;21&#x65E5; &#x51CC;&#x6668;1:38</h3>
<pre><code>&#x542C;&#x8BF4;&#x68A6;&#x60F3;&#x5728;&#x591C;&#x91CC;&#x4F1A;&#x53D1;&#x5149;&#xFF0C;&#x6216;&#x660E;&#x6216;&#x6697;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x5149;&#xFF0C;&#x5C31;&#x4F1A;&#x50CF;&#x521D;&#x751F;&#x7684;&#x65E5;&#x51FA;&#x4E00;&#x6837;&#x5189;&#x5189;&#x5347;&#x8D77;&#xFF0C;&#x91CA;&#x653E;&#x5149;&#x4E0E;&#x70ED;&#xFF0C;&#x6E29;&#x5B58;&#x4E8E;&#x4E07;&#x7269;&#x4E4B;&#x4E2D;&#x3002;
</code></pre><h3 id="2018&#x5E74;04&#x6708;22&#x65E5;-&#x534A;&#x591C;1226">2018&#x5E74;04&#x6708;22&#x65E5; &#x534A;&#x591C;12:26</h3>
<pre><code>&#x5B66;&#x4E60;&#xFF0C;&#x7126;&#x8651;&#xFF0C;&#x5B66;&#x4E60;&#xFF0C;&#x7126;&#x8651;
&#x683C;&#x5C40;&#xFF0C;&#x7EC6;&#x8282;&#xFF0C;&#x683C;&#x5C40;&#xFF0C;&#x7EC6;&#x8282;
</code></pre><h3 id="2018&#x5E74;04&#x6708;22&#x65E5;-&#x534A;&#x591C;1235">2018&#x5E74;04&#x6708;22&#x65E5; &#x534A;&#x591C;12:35</h3>
<pre><code>&#x96BE;&#x4E0E;&#x7B80;&#x5355;
&#x96BE;&#xFF0C;&#x4F46;&#x4ECD;&#x8981;&#x505A;&#xFF0C;&#x53D1;&#x73B0;&#x592A;&#x96BE;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x653E;&#x5F03;&#x5462;
&#x7B80;&#x5355;&#xFF0C;
</code></pre><h3 id="2018&#x5E74;04&#x6708;23&#x65E5;-&#x534A;&#x591C;1137">2018&#x5E74;04&#x6708;23&#x65E5; &#x534A;&#x591C;11:37</h3>
<pre><code>&#x4ED6;&#x51B3;&#x5B9A;&#x7A7F;&#x8FC7;&#x9762;&#x524D;&#x8FD9;&#x4E2A;&#x9ED1;&#x6697;&#x672A;&#x77E5;&#x7684;&#x68EE;&#x6797;&#xFF0C;&#x76F8;&#x4FE1;&#x4E0D;&#x7528;&#x591A;&#x4E45;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6CBF;&#x8DEF;&#x70B9;&#x4E0A;&#x706B;&#x5149;&#xFF0C;&#x8D70;&#x554A;&#x8D70;&#xFF0C;&#x53D1;&#x73B0;&#x53EA;&#x662F;&#x5728;&#x5F98;&#x5F8A;&#xFF0C;&#x53C8;&#x56DE;&#x5230;&#x8D77;&#x70B9;&#xFF0C;&#x4E0D;&#x7528;&#x591A;&#x4E45;&#xFF0C;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x6E10;&#x53D1;&#x5FAE;&#x5149;&#xFF0C;&#x5BF9;&#x4ED6;&#x6765;&#x8BF4;&#x65E9;&#x5DF2;&#x8F7B;&#x8F66;&#x719F;&#x8DEF;&#xFF0C;&#x4ED6;&#x6CA1;&#x6709;&#x5FD8;&#x8BB0;&#x4ED6;&#x7684;&#x521D;&#x8877;&#xFF0C;&#x89C9;&#x5F97;&#x5DF2;&#x7ECF;&#x8D70;&#x5F97;&#x8DB3;&#x591F;&#x8FDC;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x4ECD;&#x7136;&#x5728;&#x4E00;&#x4E2A;&#x68EE;&#x6797;&#x91CC;&#xFF0C;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x77AC;&#x95F4;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x660E;&#x660E;&#x662F;&#xFF1F;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x8DEF;&#x8D70;&#x5230;&#x5E95;&#xFF0C;&#x5C81;&#x6708;&#x7ED9;&#x5BB9;&#x989C;&#x62B9;&#x4E0A;&#x4E0D;&#x53EF;&#x78E8;&#x706D;&#x7684;&#x75D5;&#x8FF9;&#xFF0C;&#x7EC8;&#x4E8E;&#xFF0C;&#x529F;&#x592B;&#x4E0D;&#x8D1F;&#x6709;&#x5FC3;&#x4EBA;&#xFF0C;&#x6000;&#x7740;&#x4E07;&#x5206;&#x7684;&#x6FC0;&#x52A8;&#xFF0C;&#x4ED6;&#x6CA1;&#x89C1;&#x8FC7;&#x6D77;&#xFF0C;&#x4F46;&#x4ED6;&#x61C2;&#x5F97;&#x6D69;&#x701A;&#xFF0C;&#x4ED6;&#x7AED;&#x65AF;&#x5E95;&#x91CC;&#xFF0C;&#x4ED6;&#x53CC;&#x773C;&#x901A;&#x7EA2;&#x3002;
</code></pre><h3 id="2018&#x5E74;04&#x6708;26&#x65E5;-&#x51CC;&#x6668;150">2018&#x5E74;04&#x6708;26&#x65E5; &#x51CC;&#x6668;1:50</h3>
<pre><code>&#x8BFB;&#x4E66;&#x90A3;&#x4F1A;&#x8981;&#x662F;&#x6DF1;&#x591C;&#x4E0D;&#x5165;&#x7761;&#xFF0C;&#x6216;&#x8BB8;&#x5230;&#x9633;&#x53F0;&#x201C;&#x89E3;&#x653E;&#x201D;&#x4E00;&#x4E0B;&#xFF0C;&#x6708;&#x5149;&#x6B63;&#x597D;&#x7ED9;&#x5468;&#x906D;&#x8499;&#x4E0A;&#x4E00;&#x5C42;&#x5149;&#x5708;&#xFF0C;&#x6DF1;&#x9083;&#x795E;&#x79D8;&#x7684;&#x591C;&#x7A7A;&#x66F4;&#x50CF;&#x662F;&#x4E16;&#x754C;&#x672C;&#x76F8;&#xFF0C;&#x6B64;&#x523B;&#x6CA1;&#x6709;&#x5B66;&#x4E1A;&#x538B;&#x529B;&#xFF0C;&#x6CA1;&#x6709;&#x5C31;&#x4E1A;&#x7126;&#x8651;&#xFF0C;
</code></pre><h3 id="2018&#x5E74;5&#x6708;2&#x65E5;-&#x665A;&#x4E0A;1023">2018&#x5E74;5&#x6708;2&#x65E5; &#x665A;&#x4E0A;10:23</h3>
<pre><code>&#x6728;&#x5C4B;&#x91CC;&#xFF0C;&#x7559;&#x4E86;&#x7684;&#x4E00;&#x4E2A;&#x89D2;&#x843D;&#xFF0C;&#x5E03;&#x7740;&#x539A;&#x8584;&#x4E0D;&#x4E00;&#x7684;&#x7070;&#x5C18;&#xFF0C;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x53BB;&#x67E5;&#x770B;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x53BB;&#x64E6;&#x62ED;&#xFF0C;&#x5728;&#x6700;&#x5E95;&#x4E0B;&#xFF0C;&#x5C31;&#x523B;&#x7740;&#x4E00;&#x4E9B;&#x5B57;&#xFF0C;&#x8981;&#x662F;&#x54EA;&#x5929;&#x53BB;&#x7FFB;&#x770B;&#x4E86;&#xFF0C;&#x5B9A;&#x8981;&#x505A;&#x597D;&#x51C6;&#x5907;&#xFF0C;&#x6B64;&#x5916;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x9009;&#x62E9;&#x6027;&#x5931;&#x53BB;&#x8BB0;&#x5FC6;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;3&#x65E5;-&#x51CC;&#x6668;157">2018&#x5E74;5&#x6708;3&#x65E5; &#x51CC;&#x6668;1:57</h3>
<pre><code>&#x74E6;&#x5C4B;&#x91CC;&#x7684;&#x4ED6;&#x6765;&#x56DE;&#x8E31;&#x6B65;&#xFF0C;&#x7A7F;&#x900F;&#x4E0B;&#x6765;&#x7684;&#x6708;&#x5149;&#x4E0E;&#x8336;&#x51E0;&#x4E0A;&#x706B;&#x6C34;&#x706F;&#x5149;&#x4E00;&#x77AC;&#x95F4;&#x76F8;&#x4EA4;&#x5373;&#x8FC5;&#x901F;&#x62C9;&#x8FDC;&#x8DDD;&#x79BB;&#xFF0C;&#x628A;&#x8EAB;&#x5F71;&#x62C9;&#x957F;&#x518D;&#x62C9;&#x957F;&#xFF0C;&#x5982;&#x9B3C;&#x9B45;&#x51FA;&#x6CA1;&#x4E00;&#x822C;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;4&#x65E5;-&#x51CC;&#x6668;201">2018&#x5E74;5&#x6708;4&#x65E5; &#x51CC;&#x6668;2:01</h3>
<pre><code>&#x7BA1;&#x4ED6;&#x6B6A;&#x98CE;&#x659C;&#x96E8;&#xFF0C;&#x4ED6;&#x4E00;&#x4E1D;&#x4E0D;&#x82DF;&#xFF0C;&#x6495;&#x5F00;&#x90A3;&#x4E2A;&#x8001;&#x706F;&#x7B3C;&#xFF0C;&#x706B;&#x5149;&#x51B2;&#x51FB;&#x9752;&#x5929;&#xFF0C;&#x6DE1;&#x7136;&#x5730;&#xFF0C;&#x5543;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x5473;&#x9053;&#xFF0C;&#x53EA;&#x662F;&#x6000;&#x5FF5;&#x90A3;&#x4E9B;&#x6253;&#x66F4;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x5E26;&#x7740;&#x90AA;&#x9B45;&#x4E00;&#x7B11;&#xFF0C;&#x8EAB;&#x5F71;&#x9690;&#x7EA6;&#xFF0C;&#x4E0E;&#x6C38;&#x4E45;&#x9ED1;&#x591C;&#x878D;&#x4E3A;&#x4E00;&#x7247;&#x5BC2;&#x9759;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;6&#x65E5;-&#x534A;&#x591C;1130">2018&#x5E74;5&#x6708;6&#x65E5; &#x534A;&#x591C;11:30</h3>
<pre><code>&#x542C;&#x8BF4;&#x591C;&#x91CC;&#x65F6;&#x95F4;&#x6D41;&#x901F;&#x90FD;&#x662F;&#x6052;&#x5B9A;&#x7684;&#xFF0C;&#x4ED6;&#x8FDB;&#x5165;&#x7684;&#x7A7A;&#x95F4;&#x7D27;&#x7F29;&#x6536;&#x62E2;&#x5F2F;&#x66F2;&#xFF0C;&#x4EBA;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x8868;&#x9762;&#x4E0A;&#x65E0;&#x5F02;&#x5E38;&#xFF0C;&#x53EA;&#x662F;&#x591C;&#x6765;&#x5F97;&#x66F4;&#x6F2B;&#x957F;&#xFF0C;&#x6253;&#x66F4;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x6D88;&#x78E8;&#x65F6;&#x95F4;&#xFF0C;&#x6C89;&#x8FF7;&#x4E8E;&#x8FFD;&#x9010;&#x706F;&#x7B3C;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x4ED6;&#x6700;&#x65E0;&#x6240;&#x62D8;&#x675F;&#x5927;&#x6B65;&#x8FC8;&#x5F00;&#x811A;&#x6B65;&#x7684;&#x65F6;&#x523B;&#xFF0C;&#x6708;&#x5149;&#x6389;&#x843D;&#x5230;&#x80A9;&#x4E0A;&#xFF0C;&#x6E85;&#x5C04;&#x51FA;&#x7FA4;&#x661F;&#x707F;&#x70C2;&#xFF0C;&#x68A6;&#x5E7B;&#x661F;&#x6CB3;&#xFF0C;&#x4EFF;&#x4F5B;&#x8BB0;&#x8D77;&#x6628;&#x591C;&#x68A6;&#x91CC;&#x65E0;&#x5C3D;&#x7684;&#x9050;&#x60F3;&#xFF0C;

&#x6708;&#x5149;&#x4E0D;&#x5C0F;&#x5FC3;&#x6389;&#x843D;&#x5230;&#x4ED6;&#x7684;&#x80A9;&#x8180;&#x4E0A;
&#x6563;&#x843D;&#x4E00;&#x5730;&#x661F;&#x661F;&#x70B9;&#x70B9;
&#x63E1;&#x7740;&#x7684;&#x5149;&#x8292;&#x7A7F;&#x900F;&#x8FC7;&#x8EAB;&#x8EAF;
&#x892A;&#x53BB;&#x90A3;&#x9ED1;&#x591C;&#x7684;&#x76F8;&#x8C8C;
&#x773C;&#x524D;&#x7684;&#x68A6;&#x5E7B;&#x661F;&#x6CB3;
&#x597D;&#x50CF;&#xFF0C;&#x597D;&#x50CF;&#x68A6;&#x60F3;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;
</code></pre><h3 id="2018&#x5E74;5&#x6708;10&#x65E5;-&#x51CC;&#x6668;100">2018&#x5E74;5&#x6708;10&#x65E5; &#x51CC;&#x6668;1:00</h3>
<pre><code>&#x81EA;&#x4ECE;&#x4ED6;&#x7684;&#x706F;&#x7B3C;&#x9057;&#x5931;&#x540E;&#xFF0C;&#x6BCF;&#x65E5;&#x90FD;&#x975E;&#x5E38;&#x6CAE;&#x4E27;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x665A;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x5728;&#x4ED6;&#x5BB6;&#x95E8;&#x524D;&#x90A3;&#x53E3;&#x8001;&#x4E95;&#x660E;&#x660E;&#x770B;&#x5230;&#x4ED6;&#x7684;&#x706F;&#x7B3C;&#xFF0C;&#x5FFD;&#x660E;&#x5FFD;&#x6697;&#x5C31;&#x5728;&#x6700;&#x6DF1;&#x5904;&#xFF0C;&#x6708;&#x5149;&#x4E0B;&#x663E;&#x5F97;&#x683C;&#x5916;&#x660E;&#x4EAE;&#xFF0C;&#x57CB;&#x5934;&#x8FDB;&#x53BB;&#xFF0C;&#x559C;&#x51FA;&#x671B;&#x5916;&#x627E;&#x5230;&#x4E86;&#x706F;&#x7B3C;&#xFF0C;&#x66F4;&#x592B;&#x53C8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6253;&#x66F4;&#x4E86;&#xFF0C;&#x968F;&#x98CE;&#x5165;&#x591C;&#xFF0C;&#x706F;&#x7B3C;&#x7684;&#x5F71;&#x5B50;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;10&#x65E5;-&#x51CC;&#x6668;105">2018&#x5E74;5&#x6708;10&#x65E5; &#x51CC;&#x6668;1:05</h3>
<pre><code>&#x6CA1;&#x6709;&#x4E86;&#x66F4;&#x592B;&#xFF0C;&#x706F;&#x7B3C;&#x72EC;&#x81EA;&#x4E0A;&#x8857;&#x6253;&#x66F4;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EBA;&#x89C9;&#x5F97;&#x5947;&#x602A;&#xFF0C;&#x9760;&#x8FD1;&#x770B;&#xFF0C;&#x706F;&#x7B3C;&#x7684;&#x5F71;&#x5B50;&#x660E;&#x660E;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;11&#x65E5;-&#x51CC;&#x6668;117">2018&#x5E74;5&#x6708;11&#x65E5; &#x51CC;&#x6668;1:17</h3>
<pre><code>&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x4ED6;&#x8FD8;&#x6CA1;&#x627E;&#x5230;&#xFF0C;&#x8FD8;&#x6CA1;&#x56DE;&#x8FC7;&#x795E;&#x6765;&#xFF0C;&#x5DF2;&#x7ECF;&#x8D70;&#x5230;&#x5C71;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BB8;&#x4E45;&#x672A;&#x6765;&#x63A2;&#x8BBF;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x62B1;&#x5E0C;&#x671B;&#x5730;&#x6765;&#x5BFB;&#x627E;&#x9057;&#x5931;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4ECE;&#x5C71;&#x6D1E;&#x7684;&#x6DF1;&#x5904;&#xFF0C;&#x8F93;&#x9001;&#x51FA;&#x4E00;&#x5377;&#x51B0;&#x51B7;&#x7684;&#x7075;&#x98CE;&#xFF0C;&#x9AA8;&#x5934;&#x91CC;&#x4F20;&#x6765;&#x4E00;&#x9635;&#x7206;&#x88C2;&#x822C;&#x75DB;&#x5FEB;&#x611F;&#xFF0C;&#x4EFF;&#x4F5B;&#x5FC3;&#x810F;&#x5373;&#x5C06;&#x8981;&#x88AB;&#x6495;&#x88C2;&#xFF0C;&#x5927;&#x6B65;&#x8FC8;&#x53BB;&#xFF0C;&#x66F2;&#x5F84;&#x901A;&#x5E7D;&#x5904;&#xFF0C;&#x5E7D;&#x6709;&#x6697;&#x9B42;&#x9999;&#xFF0C;&#x66F4;&#x592B;&#x770B;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x5BF9;&#x7ACB;&#x9762;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x50CF;&#x662F;&#x5728;&#x95ED;&#x76EE;&#x517B;&#x795E;&#xFF0C;&#x4E00;&#x52A8;&#x4E0D;&#x52A8;&#xFF0C;&#x800C;&#x4ED6;&#x795E;&#x60C5;&#x6DE1;&#x6F20;&#xFF0C;&#x5FC3;&#x4E2D;&#x6CA1;&#x6709;&#x534A;&#x70B9;&#x6D9F;&#x6F2A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x65E9;&#x5C31;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x60F3;&#x4ED6;&#x5E94;&#x8BE5;&#x79BB;&#x5F00;&#x4E86;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x518D;&#x627E;&#x4E86;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8EAB;&#x4F53;&#x65E0;&#x6CD5;&#x52A8;&#x5F39;&#xFF0C;&#x6CA1;&#x7B49;&#x4ED6;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x4E0B;&#x4E00;&#x523B;&#x5CA9;&#x58C1;&#x6E17;&#x51FA;&#x4E00;&#x4E9B;&#x8840;&#x7EA2;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x4E00;&#x80A1;&#x53E4;&#x8001;&#x7684;&#x6C14;&#x606F;&#xFF0C;&#x4E0D;&#x8BA4;&#x5F97;&#x5374;&#x53C8;&#x4F3C;&#x66FE;&#x76F8;&#x8BC6;&#xFF0C;&#x4E00;&#x7247;&#x7EA2;&#x6D77;&#x5DF2;&#x7ECF;&#x76D6;&#x8FC7;&#x4ED6;&#x7684;&#x80A9;&#x8180;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4ECE;&#x5BF9;&#x7ACB;&#x8D70;&#x5230;&#x7EDF;&#x4E00;&#xFF0C;&#x7329;&#x7EA2;&#x7684;&#x5929;&#x9645;&#x5728;&#x5915;&#x9633;&#x6620;&#x886C;&#x4E0B;&#x683C;&#x5916;&#x5996;&#x5A06;&#xFF0C;&#x8FD9;&#x624D;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;12&#x65E5;-&#x534A;&#x591C;1206">2018&#x5E74;5&#x6708;12&#x65E5; &#x534A;&#x591C;12:06</h3>
<pre><code>&#x9AD8;&#x8038;&#x5165;&#x4E91;&#xFF0C;
&#x8FC2;&#x56DE;&#x66F2;&#x6298;&#xFF0C;
&#x8FDC;&#x8FD1;&#x9AD8;&#x4F4E;&#xFF0C;
&#x671B;&#x5C3D;&#x5929;&#x6DAF;&#x8DEF;&#xFF0C;
</code></pre><h3 id="2018&#x5E74;5&#x6708;12&#x65E5;-&#x534A;&#x591C;1258">2018&#x5E74;5&#x6708;12&#x65E5; &#x534A;&#x591C;12:58</h3>
<pre><code>&#x4E00;&#x4E9B;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x4ED6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x6BD4;&#x5982;&#x6751;&#x4E1C;&#x8001;&#x738B;&#x5BB6;&#x7684;&#x571F;&#x72D7;&#x76F8;&#x4E2D;&#x6751;&#x897F;&#x8001;&#x8D75;&#x5BB6;&#x7684;&#x6D0B;&#x72D7;&#xFF0C;&#x6DF1;&#x591C;&#x7A9C;&#x4E0A;&#x7A97;&#x53F0;&#x5E7D;&#x4F1A;&#xFF0C;&#x8FD8;&#x6709;&#x4F4F;&#x5728;&#x5C71;&#x4E0A;&#x7684;&#x5C0F;&#x674E;&#xFF0C;&#x6574;&#x665A;&#x90FD;&#x70B9;&#x7740;&#x706F;&#x88F8;&#x7761;&#xFF0C;&#x518D;&#x6709;&#x6768;&#x5458;&#x5916;&#x540E;&#x5DF7;&#x7684;&#x8001;&#x9F20;&#x5DF2;&#x7ECF;&#x662F;&#x7B2C;&#x4E09;&#x80CE;&#xFF0C;&#x4E00;&#x5BB6;&#x5B50;&#x5176;&#x4E50;&#x878D;&#x878D;&#xFF0C;&#x8FD8;&#x518D;&#x6709;&#x90A3;&#x4E2A;&#x6CB3;&#x6D8C;&#x8FB9;&#x88AB;&#x66F4;&#x592B;&#x6551;&#x4E0A;&#x6765;&#x7684;&#x65E0;&#x8138;&#x5973;&#x5B50;&#xFF0C;&#x4E00;&#x53E5;&#x8BDD;&#x90FD;&#x4E0D;&#x8BF4;&#x4E5F;&#x6CA1;&#x89C1;&#x5979;&#x8D70;&#x52A8;&#x8FC7;&#xFF0C;&#x6BCF;&#x665A;&#x5446;&#x5728;&#x90A3;&#x5446;&#x5230;&#x5929;&#x4EAE;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x7EC6;&#x6570;&#xFF0C;&#x66F4;&#x592B;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x4E00;&#x5207;&#x4ED6;&#x90FD;&#x770B;&#x5728;&#x773C;&#x91CC;&#xFF0C;&#x53EA;&#x6709;&#x4ED6;&#x770B;&#x5230;&#x7684;&#x4E8B;&#x4EF6;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x6B64;&#x5916;&#x7684;&#x8FD8;&#x662F;&#x5904;&#x4E8E;&#x4E00;&#x79CD;&#x6DF7;&#x6C8C;&#x72B6;&#x6001;&#xFF0C;
</code></pre><h3 id="2018&#x5E74;5&#x6708;25&#x65E5;-&#x534A;&#x591C;1235">2018&#x5E74;5&#x6708;25&#x65E5; &#x534A;&#x591C;12:35</h3>
<pre><code>&#x4E0D;&#x6253;&#x66F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x559C;&#x6B22;&#x8E72;&#x5728;&#x67AF;&#x4E95;&#x91CC;&#xFF0C;&#x5E26;&#x7740;&#x4ED6;&#x559C;&#x6B22;&#x7684;&#x706F;&#x7B3C;&#xFF0C;&#x6BCF;&#x6B21;&#x706F;&#x706B;&#x7167;&#x51FA;&#x4ED6;&#x5BB9;&#x989C;&#x7684;&#x5F71;&#x5B50;&#xFF0C;&#x4FBF;&#x96D5;&#x523B;&#x5230;&#x77F3;&#x58C1;&#x4E0A;&#xFF0C;&#x4ED6;&#x770B;&#x4E0D;&#x89C1;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x624B;&#x53BB;&#x611F;&#x89C9;&#xFF0C;&#x5751;&#x5751;&#x6D3C;&#x6D3C;&#xFF0C;&#x6DF1;&#x9677;&#x5176;&#x4E2D;&#x3002;
</code></pre><h3 id="2018&#x5E74;5&#x6708;26&#x65E5;-&#x51CC;&#x6668;145">2018&#x5E74;5&#x6708;26&#x65E5; &#x51CC;&#x6668;1:45</h3>
<pre><code>&#x4E00;&#x5934;&#x683D;&#x4E86;&#x8FDB;&#x53BB;&#xFF0C;&#x6C34;&#x6D45;&#x5F97;&#x5F88;&#xFF0C;&#x5543;&#x4E86;&#x53E3;&#x6CE5;&#x571F;&#xFF0C;&#x545B;&#x5F97;&#x96BE;&#x53D7;&#xFF0C;&#x628A;&#x85CF;&#x5728;&#x9F3B;&#x5B54;&#x7684;&#x86AF;&#x8693;&#x90FD;&#x55B7;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5927;&#x4E30;&#x6536;&#x554A;&#xFF01;
</code></pre><h3 id="2018&#x5E74;5&#x6708;26&#x65E5;-&#x51CC;&#x6668;202">2018&#x5E74;5&#x6708;26&#x65E5; &#x51CC;&#x6668;2:02</h3>
<pre><code>&#x5947;&#x4E86;&#x4E2A;&#x602A;&#xFF0C;&#x4ECA;&#x665A;&#x8D75;&#x56DB;&#x5BB6;&#x7684;&#x571F;&#x72D7;&#x5420;&#x4E2A;&#x4E0D;&#x505C;&#xFF0C;&#x5927;&#x534A;&#x591C;&#x9664;&#x4E86;&#x4ED6;&#x8857;&#x4E0A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x5976;&#x5976;&#x6EF4;&#xFF0C;&#x66F4;&#x592B;&#x4E00;&#x9635;&#x5492;&#x9A82;&#xFF0C;&#x90A3;&#x53EA;&#x72D7;&#x671D;&#x4ED6;&#x5954;&#x53BB;&#xFF0C;&#x5FC3;&#x91CC;&#x90A3;&#x4E2A;&#x6002;&#x554A;&#xFF0C;&#x8D76;&#x7D27;&#x9003;&#xFF0C;&#x4E3A;&#x4E86;&#x8DD1;&#x5FEB;&#x70B9;&#xFF0C;&#x7528;&#x624B;&#x628A;&#x5934;&#x7ED1;&#x5728;&#x8170;&#x95F4;&#xFF0C;&#x53EF;&#x72D7;&#x6BD5;&#x7ADF;&#x662F;&#x72D7;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x6761;&#x8BAD;&#x7EC3;&#x6709;&#x7D20;&#x7684;&#x72D7;&#xFF0C;&#x72D7;&#x8FD8;&#x662F;&#x8FFD;&#x4E86;&#x4E0A;&#x6765;&#xFF0C;&#x53EF;&#x76EE;&#x6807;&#x4E0D;&#x662F;&#x4ED6;&#xFF0C;&#x90A3;&#x4E2A;&#x65B9;&#x5411;&#x6B63;&#x662F;&#x4ED6;&#x7684;&#x74E6;&#x5C4B;&#xFF0C;&#x624B;&#x677E;&#x4E86;&#x4E0B;&#x6765;
</code></pre><h3 id="2018&#x5E74;5&#x6708;27&#x65E5;-&#x665A;&#x4E0A;827">2018&#x5E74;5&#x6708;27&#x65E5; &#x665A;&#x4E0A;8:27</h3>
<pre><code>&#x573A;&#x666F;&#x4E00;
&#x6C99;&#x6F20;&#x53C8;&#x9AD8;&#x53C8;&#x9661;&#x7684;&#x5761;&#x4E0A;&#xFF0C;&#x4ECE;&#x9AD8;&#x5230;&#x4F4E;&#xFF0C;&#x4E00;&#x5B57;&#x6392;&#x5F00;&#x6570;&#x4E0D;&#x6E05;&#x7684;&#x644A;&#x4F4D;&#xFF0C;&#x4EBA;&#x7FA4;&#x7199;&#x7199;&#x6518;&#x6518;&#xFF0C;&#x4ECE;&#x9AD8;&#x5904;&#x671B;&#x53BB;&#xFF0C;&#x5BC6;&#x5BC6;&#x9EBB;&#x9EBB;&#x53EA;&#x662F;&#x877C;&#x8681;&#x4E00;&#x822C;&#xFF0C;&#x79BB;&#x5761;&#x4E0B;&#x4E0D;&#x8FDC;&#x5C31;&#x662F;&#x9644;&#x8FD1;&#x4EC5;&#x5269;&#x7684;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#xFF0C;&#x548C;&#x671B;&#x5411;&#x5C3D;&#x5934;&#x7684;&#x4E24;&#x5757;&#x7EFF;&#x6D32;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x9762;&#x79EF;&#x4E0D;&#x5927;&#xFF0C;&#x8038;&#x7740;&#x9AD8;&#x697C;&#xFF0C;&#x683C;&#x5916;&#x663E;&#x773C;&#xFF0C;&#x6CBF;&#x7740;&#x4EBA;&#x884C;&#x9053;&#xFF0C;&#x5411;&#x90A3;&#x4E2A;&#x5373;&#x5C06;&#x6B8B;&#x8D25;&#x7684;&#x57CE;&#x5E02;&#x8FDB;&#x53D1;&#x3002;
&#x573A;&#x666F;&#x4E8C;
&#x4ED6;&#x6B63;&#x5F80;&#x6751;&#x91CC;&#x6E21;&#x53E3;&#x65B9;&#x5411;&#x8D70;&#x53BB;&#xFF0C;&#x7A7F;&#x8FC7;&#x5DF7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x6D6A;&#x51B2;&#x4E86;&#x4E0A;&#x6765;&#xFF0C;&#x6C34;&#x6E05;&#x6F88;&#x5F97;&#x5F88;&#xFF0C;&#x53C8;&#x63A5;&#x4E00;&#x6D6A;&#xFF0C;&#x5230;&#x819D;&#x76D6;&#xFF0C;&#x5230;&#x8170;&#xFF0C;&#x5230;&#x80A9;&#x8180;&#xFF0C;&#x8DD1;&#x4E86;&#x51E0;&#x4E2A;&#x8DEF;&#x53E3;&#xFF0C;&#x94A2;&#x81C2;&#x67B6;&#x4F4F;&#x6570;&#x6761;&#x9AD8;&#x538B;&#x7EBF;&#x4EA4;&#x7EC7;&#x51FA;&#x86DB;&#x4E1D;&#x6837;&#x7684;&#x7EB9;&#x8DEF;&#xFF0C;&#x90A3;&#x4E9B;&#x51E0;&#x5341;&#x5C42;&#x7684;&#x9AD8;&#x697C;&#xFF0C;&#x628A;&#x540C;&#x6837;&#x9AD8;&#x7684;&#x6D6A;&#x74DC;&#x5206;&#x6210;&#x4E24;&#x622A;&#xFF0C;&#x697C;&#x9876;&#x55B7;&#x53D1;&#x7684;&#x6C34;&#x6DCB;&#x5230;&#x4ED6;&#x7684;&#x8EAB;&#x4E0A;&#xFF0C;&#x5468;&#x56F4;&#x7684;&#x5E97;&#x94FA;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4EBA;&#x4E86;&#x3002;
&#x573A;&#x666F;&#x4E09;
&#x63A5;&#x8FC7;&#x4E86;&#x9ED1;&#x76D2;&#xFF0C;&#x5728;&#x6697;&#x683C;&#x5904;&#x53D6;&#x51FA;&#x4E00;&#x9053;&#x201C;&#x5BC6;&#x65E8;&#x201D;&#xFF0C;&#x610F;&#x8BC6;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x6670;&#xFF0C;&#x53EA;&#x8BB0;&#x5F97;&#x4E00;&#x90E8;&#x5206;&#xFF0C;2010&#x5E74;x&#x6708;&#xFF0C;xx&#x4EBA;&#x53E3;&#x538B;&#x529B;xx&#xFF0C;xx&#x8FC7;&#x5269;xx&#xFF0C;xx&#x4E8F;&#xFF0C;&#x6D88;&#x706D;xx&#xFF0C;&#x653F;&#x5E9C;&#x90E8;&#x3002;
&#x573A;&#x666F;&#x56DB;
&#x5411;&#x57CE;&#x5E02;&#x8FDB;&#x53D1;&#xFF0C;&#x5BFB;&#x627E;&#x89E3;&#x6551;&#x4E4B;&#x9053;&#xFF0C;&#x6309;&#x7960;&#x5802;&#x91CC;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x5148;&#x8D24;&#x628A;&#x5B83;&#x5B58;&#x5728;&#x53E6;&#x4E00;&#x5904;&#xFF0C;&#x8FD9;&#x91CC;&#x6C14;&#x6C1B;&#x68EE;&#x4E25;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x961F;&#x6B63;&#x5728;&#x6F14;&#x7EC3;&#xFF0C;&#x8EAB;&#x540E;&#x7684;&#x5B9E;&#x9A8C;&#x5BA4;&#x62C9;&#x51FA;&#x597D;&#x51E0;&#x7F50;&#x7EFF;&#x8272;&#x7684;&#x8BD5;&#x9A8C;&#x54C1;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x7F50;&#x53D1;&#x751F;&#x4E86;&#x81EA;&#x71C3;&#xFF0C;&#x7206;&#x70B8;&#x8303;&#x56F4;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x5DE5;&#x4F5C;&#x8005;&#x5E76;&#x6CA1;&#x6709;&#x53D7;&#x4F24;&#xFF0C;&#x4ED6;&#x6084;&#x6084;&#x6F5C;&#x8FC7;&#x53BB;&#xFF0C;&#x5B88;&#x7740;&#x4E00;&#x4F4D;&#x5C0F;&#x50E7;&#xFF0C;&#x62D2;&#x7EDD;&#x4E86;&#x63A2;&#x8BBF;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x6765;&#x610F;&#xFF0C;&#x957F;&#x8001;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x7B54;&#x5E94;&#x5F52;&#x8FD8;&#x5148;&#x7269;&#xFF0C;&#x4F46;&#x4E0D;&#x5141;&#x8BB8;&#x5230;&#x91CC;&#x9762;&#x53BB;&#x3002;
&#x62D3;&#x5C55;
&#x8FD9;&#x91CC;&#x8F6F;&#x7981;&#x7740;&#x4E00;&#x6279;&#x79D1;&#x5B66;&#x5BB6;&#xFF0C;&#x4ED6;&#x4EEC;&#x7814;&#x7A76;&#x51FA;&#x4E00;&#x79CD;&#x8F90;&#x5C04;&#x6CE2;&#xFF0C;&#x80FD;&#x591F;&#x5F15;&#x5BFC;&#x5929;&#x4F53;&#x8FD0;&#x52A8;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x6216;&#x9006;&#x8F6C;&#x4E00;&#x4E9B;&#x81EA;&#x7136;&#x73B0;&#x8C61;&#x3002;
&#x65B0;&#x7EAA;&#x5143;&#x6700;&#x540E;&#x786E;&#x7ACB;&#x4E86;&#x4E09;&#x754C;&#x5212;&#x5206;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E9B;&#x8D35;&#x65CF;&#x548C;&#x7EDF;&#x6CBB;&#x8005;&#x5C45;&#x4F4F;&#x5929;&#x7A7A;&#xFF0C;&#x800C;&#x9646;&#x5730;&#x5927;&#x591A;&#x662F;&#x4E00;&#x7247;&#x7247;&#x8352;&#x6F20;&#xFF0C;&#x8D44;&#x6E90;&#x5927;&#x90E8;&#x5206;&#x88AB;&#x8FC1;&#x79FB;&#xFF0C;&#x7559;&#x4E86;&#x5C11;&#x6570;&#x7EFF;&#x6D32;&#x4F9B;&#x5B98;&#x65B9;&#x7BA1;&#x7406;&#x8005;&#x5C45;&#x4F4F;&#xFF0C;&#x6B64;&#x65F6;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x5BC6;&#x4F1A;&#x4E0A;&#x7EA7;&#x65E8;&#x610F;&#x3002;
&#x6765;&#x4E0D;&#x53CA;&#x963B;&#x6B62;&#xFF0C;&#x5929;&#x4F53;&#x8FD8;&#x662F;&#x88AB;&#x5F15;&#x5BFC;&#xFF0C;&#x4E00;&#x6CE2;&#x4F3C;&#x66FE;&#x76F8;&#x8BC6;&#x7684;&#x6D6A;&#x6F6E;&#x6B63;&#x5728;&#x6765;&#x88AD;&#xFF0C;&#x6216;&#x8BB8;&#x53EA;&#x6709;&#x9AD8;&#x7EA7;&#x77E5;&#x8BC6;&#x5206;&#x5B50;&#x548C;&#x7CBE;&#x82F1;&#x52C9;&#x5F3A;&#x5E78;&#x514D;&#x3002;
&#x7531;&#x4E8E;&#x667A;&#x80FD;&#x5316;&#x5DF2;&#x7ECF;&#x662F;&#x975E;&#x5E38;&#x666E;&#x53CA;&#xFF0C;&#x4E0D;&#x5FC5;&#x4F9D;&#x8D56;&#x4EBA;&#x53E3;&#x6765;&#x652F;&#x6491;&#x6574;&#x4E2A;&#x7ECF;&#x6D4E;&#x4F53;&#xFF0C;&#x800C;&#x4EBA;&#x53E3;&#x4E0E;&#x7528;&#x5730;&#x65E5;&#x76CA;&#x7D27;&#x5F20;&#x3002;
</code></pre><h3 id="2018&#x5E74;6&#x6708;1&#x65E5;-&#x51CC;&#x6668;132">2018&#x5E74;6&#x6708;1&#x65E5; &#x51CC;&#x6668;1:32</h3>
<pre><code>&#x6D17;&#x4E86;&#x628A;&#x8138;&#xFF0C;&#x68B3;&#x5986;&#x4E00;&#x756A;&#xFF0C;&#x6447;&#x6643;&#x7740;&#x8FAB;&#x5B50;&#x4E0A;&#x8857;&#x53BB;&#xFF01;&#x4ED6;&#x5E76;&#x4E0D;&#x5728;&#x610F;&#x8D70;&#x54EA;&#x6761;&#x8857;&#x54EA;&#x6761;&#x5DF7;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x662F;&#x6B7B;&#x8DEF;&#xFF0C;&#x9ED1;&#x591C;&#x5BF9;&#x4ED6;&#x6765;&#x8BF4;&#x518D;&#x4E5F;&#x6CA1;&#x6709;&#x795E;&#x79D8;&#x611F;&#xFF0C;&#x5446;&#x5728;&#x6751;&#x91CC;&#x5C31;&#x662F;&#x4ED6;&#x7684;&#x4F59;&#x751F;&#x3002;
</code></pre><h3 id="2018&#x5E74;6&#x6708;4&#x65E5;-&#x534A;&#x591C;1221">2018&#x5E74;6&#x6708;4&#x65E5; &#x534A;&#x591C;12:21</h3>
<pre><code>&#x5582;&#xFF0C;&#x66F4;&#x592B;&#xFF0C;&#x4F60;&#x6700;&#x60F3;&#x53BB;&#x54EA;&#x91CC;
&#x6708;&#x5149;&#x8FB9;&#x5883;&#x554A;
&#x53BB;&#x90A3;&#x91CC;&#x505A;&#x4EC0;&#x4E48;&#x5462;
&#x542C;&#x6708;&#x5149;&#x8FB9;&#x5883;&#x554A;
&#x8FD8;&#x6709;&#x5462;
&#x6CA1;&#x4E86;
&#x4E0D;&#x662F;&#x5427;&#xFF0C;&#x4E0D;&#x4F1A;&#x5B64;&#x72EC;&#x5417;
&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x5BC2;&#x5BDE;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x8FFD;&#x6C42;
&#x90A3;&#x4F60;&#x73B0;&#x5728;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x53BB;&#x5462;
&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x767D;&#x5929;
&#x90A3;&#x591C;&#x665A;&#x4F60;&#x662F;&#x6B65;&#x884C;&#x53BB;&#x5417;
&#x95ED;&#x4E0A;&#x773C;&#x5C31;&#x884C;&#x4E86;
&#x542C;&#x4E0A;&#x53BB;&#x4E0D;&#x662F;&#x5F88;&#x73B0;&#x5B9E;
&#x6CA1;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x80FD;&#x5206;&#x6E05;&#x695A;
&#x80FD;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E0B;&#x5417;
&#x628A;&#x8033;&#x6735;&#x9760;&#x8FC7;&#x6765;
</code></pre><h3 id="2018&#x5E74;6&#x6708;7&#x65E5;-&#x51CC;&#x6668;126">2018&#x5E74;6&#x6708;7&#x65E5; &#x51CC;&#x6668;1:26</h3>
<pre><code>&#x6751;&#x6C11;&#x5DF2;&#x7136;&#x719F;&#x7761;&#xFF0C;&#x8857;&#x9053;&#x4E0A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x706F;&#x706B;&#xFF0C;&#x6574;&#x4E2A;&#x4E16;&#x754C;&#x9677;&#x5165;&#x4E00;&#x7247;&#x5BC2;&#x9759;&#x4E4B;&#x4E2D;&#xFF0C;&#x66F4;&#x592B;&#x7184;&#x706D;&#x4E86;&#x706F;&#x7B3C;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x65E9;&#x5DF2;&#x5931;&#x660E;&#xFF0C;&#x9664;&#x4E86;&#x611F;&#x53D7;&#x6708;&#x5149;&#x4E4B;&#x5916;&#xFF0C;&#x597D;&#x51E0;&#x6B21;&#x4ED6;&#x8E29;&#x7A7A;&#x6389;&#x5230;&#x5858;&#x91CC;&#xFF0C;&#x4E5F;&#x8BD5;&#x8FC7;&#x8BEF;&#x5165;&#x85D5;&#x82B1;&#x6DF1;&#x5904;&#x8FF7;&#x5931;&#x65B9;&#x5411;&#xFF0C;&#x6478;&#x77F3;&#x8FC7;&#x6CB3;&#xFF0C;&#x66F2;&#x5F84;&#x901A;&#x5E7D;&#x7EDD;&#x671B;&#x4E4B;&#x9645;&#x53D1;&#x73B0;&#x56DE;&#x53BB;&#x7684;&#x8DEF;&#xFF0C;&#x4E5F;&#x89C1;&#x8FC7;&#x5CB8;&#x8FB9;&#x7684;&#x795E;&#x79D8;&#x4EBA;&#x6BCF;&#x665A;&#x54FC;&#x7740;&#x7AE5;&#x8C23;&#x7B49;&#x5230;&#x7834;&#x6653;&#xFF0C;&#x66F4;&#x592B;&#x89C9;&#x5F97;&#x4ED6;&#x5DF2;&#x7ECF;&#x9760;&#x8FD1;&#x6708;&#x5149;&#x8FB9;&#x5883;&#x4E86;&#x3002;
</code></pre><h3 id="2018&#x5E74;6&#x6708;13&#x65E5;-&#x51CC;&#x6668;155">2018&#x5E74;6&#x6708;13&#x65E5; &#x51CC;&#x6668;1:55</h3>
<pre><code>&#x884C;&#x8D70;&#x5728;&#x7A7A;&#x65E0;&#x4E00;&#x4EBA;&#x7684;&#x8857;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x503C;&#x5F97;&#x597D;&#x56DE;&#x671B;&#x7684;&#xFF0C;&#x5E26;&#x7740;&#x4ED6;&#x7684;&#x706F;&#x7B3C;&#x5F80;&#x5DF7;&#x91CC;&#x6DF1;&#x5904;&#x8DD1;&#x53BB;&#xFF0C;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x8FF7;&#x5BAB;&#xFF0C;&#x8FD9;&#x4E2A;&#x6751;&#x5B50;&#x904D;&#x5386;&#x4E86;&#x4ED6;&#x7684;&#x4E00;&#x751F;&#xFF0C;&#x4ED6;&#x4E00;&#x751F;&#x7684;&#x7F29;&#x5F71;&#x6620;&#x5C04;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x5728;&#x5DE8;&#x8F6E;&#x65E0;&#x60C5;&#x78BE;&#x538B;&#x4E0B;&#xFF0C;&#x5316;&#x4E3A;&#x5C18;&#x57C3;&#xFF0C;&#x98D8;&#x5728;&#x6E5B;&#x84DD;&#x8FDC;&#x65B9;&#x4E4B;&#x4E0A;&#x53C8;&#x6216;&#x57CB;&#x85CF;&#x6CE5;&#x571F;&#x5E95;&#x4E0B;&#x3002;
</code></pre><h3 id="2018&#x5E74;6&#x6708;13&#x65E5;-&#x51CC;&#x6668;125">2018&#x5E74;6&#x6708;13&#x65E5; &#x51CC;&#x6668;1:25</h3>
<pre><code>&#x625B;&#x4E00;&#x7F38;&#x9152;&#xFF0C;&#x722C;&#x5230;&#x5C4B;&#x9876;&#xFF0C;&#x62AB;&#x7740;&#x6574;&#x4E2A;&#x591C;&#x7A7A;&#xFF0C;&#x4F38;&#x624B;&#x628A;&#x7897;&#x635E;&#x5F2F;&#x6708;&#xFF0C;&#x4E00;&#x996E;&#x800C;&#x5C3D;&#xFF0C;&#x610F;&#x5174;&#x81F3;&#xFF0C;&#x628A;&#x7897;&#x6454;&#xFF0C;&#x6454;&#x5230;&#x9694;&#x58C1;&#x5BB6;&#x7761;&#x623F;&#xFF0C;&#x7F8E;&#x68A6;&#x4E2D;&#x9192;&#x6765;&#x7684;&#x8111;&#x888B;&#x4F38;&#x5230;&#x7A97;&#x5916;&#x9A82;&#x7239;&#x53C8;&#x9A82;&#x5A18;&#xFF0C;&#x4ED6;&#x6D51;&#x7136;&#x5F53;&#x4F5C;&#x542C;&#x4E0D;&#x89C1;&#xFF0C;&#x4E00;&#x5934;&#x683D;&#x8FDB;&#x7F38;&#x91CC;&#xFF0C;&#x5495;&#x565C;&#x51E0;&#x5927;&#x53E3;&#xFF0C;&#x5927;&#x53E3;&#x559D;&#x9152;&#x5927;&#x53E3;&#x5403;&#x8089;&#xFF0C;&#x4EBA;&#x751F;&#x8C6A;&#x8FC8;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5C11;&#x4E0D;&#x4E86;&#x4E0B;&#x9152;&#x83DC;&#xFF0C;&#x4ECE;&#x80CC;&#x540E;&#x642C;&#x51FA;&#x4E00;&#x5C0F;&#x789F;&#x7CBE;&#x81F4;&#x7684;&#x77F3;&#x5934;&#xFF0C;&#x50CF;&#x4E2A;&#x9965;&#x80A0;&#x8F98;&#x8F98;&#x7684;&#x65C5;&#x4EBA;&#xFF0C;&#x72D7;&#x541E;&#x864E;&#x54BD;&#xFF0C;&#x6574;&#x7F38;&#x9152;&#x559D;&#x4E2A;&#x7CBE;&#x5149;&#xFF0C;&#x53C8;&#x53BB;&#x4E95;&#x53E3;&#x6253;&#x4E86;&#x4E00;&#x7F38;&#x201C;&#x9152;&#x201D;&#x3002;
</code></pre><h3 id="2018&#x5E74;6&#x6708;20&#x65E5;-&#x51CC;&#x6668;135">2018&#x5E74;6&#x6708;20&#x65E5; &#x51CC;&#x6668;1:35</h3>
<pre><code>&#x4E0A;&#x6765;&#x5427;&#xFF0C;&#x5F17;&#x6D1B;&#x4F0A;&#x5FB7;&#x8BF4;&#xFF0C;&#x4E00;&#x540C;&#x53BB;&#x5230;&#x90A3;&#x4E2A;&#x9633;&#x5149;&#x94BB;&#x8FDB;&#x5DF7;&#x5B50;&#x91CC;&#x7684;&#x4E0B;&#x5348;&#xFF0C;&#x51C9;&#x98CE;&#x8F7B;&#x8F7B;&#x900F;&#x8FC7;&#x5FC3;&#x95F4;&#xFF0C;&#x770B;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x4EC5;&#x6709;&#x7684;&#x7B97;&#x5F97;&#x4E0A;&#x7F8E;&#x597D;&#x7684;&#x61A7;&#x61AC;&#x3002;
&#x6C49;&#x5C3C;&#x62D4;&#x533B;&#x751F; &#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x53EA;&#x6709;&#x6211;&#x542C;&#x5230;&#x7F8A;&#x7FA4;&#x7684;&#x53EB;&#x58F0;&#x5462;

&#x68A6;&#x91CC;&#x68A6;&#x5916;&#xFF0C;&#x82B1;&#x843D;&#x77E5;&#x591A;&#x5C11;&#x3002;
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 更夫">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"打更那些事","level":"1.6.1","depth":2,"previous":{"title":"更夫","level":"1.6","depth":1,"path":"gengfu/README.md","ref":"gengfu/README.md","articles":[{"title":"打更那些事","level":"1.6.1","depth":2,"path":"gengfu/dageng.md","ref":"gengfu/dageng.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"gengfu/dageng.md","mtime":"2018-06-25T05:43:00.652Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-26T02:44:28.540Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

